const poolConfig = {
    "1": {
        "type": "",
        "name": "常态共鸣",
        "up": ""
    },
    "2": {
        "type": "2",
        "name": "寻迹潜航",
        "up": ""
    },
    "3": {
        "type": "",
        "name": "常态共鸣·森罗万象",
        "up": ""
    },
    "4": {
        "type": "",
        "name": "常态共鸣·异世交汇",
        "up": ""
    },
    "5": {
        "type": "2",
        "name": "寻迹潜航·记忆回声",
        "up": ""
    },
    "6": {
        "type": "2",
        "name": "寻迹潜航·体质",
        "up": ""
    },
    "7": {
        "type": "2",
        "name": "寻迹潜航·防御",
        "up": ""
    },
    "8": {
        "type": "2",
        "name": "寻迹潜航·攻击",
        "up": ""
    },
    "9": {
        "type": "2",
        "name": "寻迹潜航·专精",
        "up": ""
    },
    "10": {
        "type": "2",
        "name": "寻迹潜航·终端",
        "up": ""
    },
    "100": {
        "type": "2",
        "name": "海域同游",
        "up": ""
    },
    "101": {
        "type": "",
        "name": "限域巡回",/*商城十连必出6星礼包*/
        "up": ""
    },
    "11": {
        "type": "",
        "name": "常态共鸣UP池",
        "up": "",
        "limit": [
            {
                "name": "常态共鸣.耶芙娜",
                "up": "耶芙娜",
                "startTime": "2024-01-12 07:00:00",
                "endTime": "2024-01-26 03:59:00"
            },
            {
                "name": "常态共鸣.红玉",
                "up": "红玉",
                "startTime": "2024-09-05 04:00:00",
                "endTime": "2024-09-19 03:50:00"
            },
            {
                "name": "常态共鸣.言御",
                "up": "言御",
                "startTime": "2024-09-26 04:00:00",
                "endTime": "2024-10-10 03:50:00"
            },
            {
                "name": "常态共鸣.言雀",
                "up": "言雀",
                "startTime": "2024-10-17 04:00:00",
                "endTime": "2024-10-31 03:50:00"
            },
            {
                "name": "常态共鸣.岑缨",
                "up": "岑缨",
                "startTime": "2024-11-07 04:00:00",
                "endTime": "2024-11-21 03:50:00"
            },
            {
                "name": "常态共鸣.鸢",
                "up": "鸢",
                "startTime": "2024-11-28 04:00:00",
                "endTime": "2024-12-12 03:50:00"
            },
            {
                "name": "常态共鸣.伊琅相思",
                "up": "伊琅相思",
                "startTime": "2024-12-19 04:00:00",
                "endTime": "2025-01-02 03:50:00"
            }
        ]
    },
    "12": {
        "type": "1",
        "name": "游光澄明",
        "up": "岑缨"
    },
    "13": {
        "type": "2",
        "name": "于火光中「蛋」生",
        "up": "于火光中「蛋」生"
    },
    "14": {
        "type": "1",
        "name": "玉照长夜，陈酒新酌",
        "up": "红玉"
    },
    "15": {
        "type": "1",
        "name": "岁暮重明",
        "up": "百里屠苏"
    },
    "16": {
        "type": "2",
        "name": "失途之日",
        "up": "失途之日"
    },
    "17": {
        "type": "1",
        "name": "夜幕下的本相",
        "up": "言御"
    },
    "18": {
        "type": "1",
        "name": "云端来信",
        "up": "言雀"
    },
    "19": {
        "type": "2",
        "name": "幻想彼境",
        "up": "幻想彼境"
    },
    "20": {
        "type": "1",
        "name": "飞雪初晴",
        "up": "风晴雪"
    },
    "21": {
        "type": "1",
        "name": "王牌机械师",
        "up": "乐无异"
    },
    "22": {
        "type": "2",
        "name": "天狼",
        "up": "天狼"
    },
    "23": {
        "type": "2",
        "name": "底线大作战",
        "up": "底线大作战"
    },
    "24": {
        "type": "1",
        "name": "去往彼岸",
        "up": "伊琅相思"
    },
    "25": {
        "type": "2",
        "name": "光阴间隙",
        "up": "光阴间隙"
    },
    "26": {
        "type": "1",
        "name": "再见孤蓝之海",
        "up": "尤尼"
    },
    "27": {
        "type": "2",
        "name": "潮湿前路",
        "up": "潮湿前路"
    },
    "28": {
        "type": "1",
        "name": "沉默的祷言",
        "up": "鸢"
    },
    "29": {
        "type": "2",
        "name": "如在镜中",
        "up": "如在镜中"
    },
    "30": {
        "type": "1",
        "name": "常态共鸣·蚀",
        "up": ""/*云无月特殊卡池*/
    },
    "31": {
        "type": "1",
        "name": "本真枷锁",
        "up": "提提亚"
    },
    "32": {
        "type": "2",
        "name": "无罪之徒",
        "up": "无罪之徒"
    },
    "33": {
        "type": "1",
        "name": "荣耀俯首",
        "up": "景"
    },
    "34": {
        "type": "2",
        "name": "遇见宝石海",
        "up": "遇见宝石海"
    },
    "35": {
        "type": "1",
        "name": "晴空龙吟",
        "up": "晴雪"
    },
    "36": {
        "type": "2",
        "name": "晓梦迷花",
        "up": "晓梦迷花"
    },
    "37": {
        "type": "1",
        "name": "飞鸟也栖",
        "up": "明月尘"
    },
    "38": {
        "type": "2",
        "name": "棺中鸟",
        "up": "棺中鸟"
    },
    "39": {
        "type": "1",
        "name": "凡我之至",
        "up": "缇诗"
    },
    "40": {
        "type": "2",
        "name": "魇境边界",
        "up": "魇境边界"
    },
    "41": {
        "type": "1",
        "name": "荒土悲歌",
        "up": "米达斯"
    },
    "42": {
        "type": "2",
        "name": "怯者的墓志铭",
        "up": "怯者的墓志铭"
    },
    "43": {
        "type": "1",
        "name": "振玉知微",
        "up": "珑"
    },
    "44": {
        "type": "2",
        "name": "千灯无间",
        "up": "千灯无间"
    },
    "45": {
        "type": "1",
        "name": "渊火伏明",
        "up": "林"
    },
    "46": {
        "type": "2",
        "name": "野风",
        "up": "野风"
    }
}

const roleConfig = {
    "101": {
        "rarity": "1",
        "name": "老板"
    },
    "102": {
        "rarity": "1",
        "name": "Sweeper-EX"
    },
    "201": {
        "rarity": "1",
        "name": "豹富"
    },
    "301": {
        "rarity": "4",
        "name": "田偌"
    },
    "302": {
        "rarity": "4",
        "name": "艾摩诃"
    },
    "303": {
        "rarity": "4",
        "name": "元桃桃"
    },
    "304": {
        "rarity": "4",
        "name": "霍冉"
    },
    "306": {
        "rarity": "4",
        "name": "狄砚"
    },
    "401": {
        "rarity": "4",
        "name": "刘兄"
    },
    "402": {
        "rarity": "4",
        "name": "马尔斯"
    },
    "403": {
        "rarity": "4",
        "name": "长谣"
    },
    "404": {
        "rarity": "4",
        "name": "唐路遥"
    },
    "405": {
        "rarity": "4",
        "name": "焰响"
    },
    "406": {
        "rarity": "4",
        "name": "赫九逸"
    },
    "407": {
        "rarity": "5",
        "name": "莉缇亚"
    },
    "409": {
        "rarity": "5",
        "name": "吉娜"
    },
    "410": {
        "rarity": "4",
        "name": "岚岚"
    },
    "501": {
        "rarity": "5",
        "name": "襄铃"
    },
    "502": {
        "rarity": "5",
        "name": "罗咤"
    },
    "503": {
        "rarity": "5",
        "name": "阳铃"
    },
    "504": {
        "rarity": "5",
        "name": "禺期"
    },
    "505": {
        "rarity": "5",
        "name": "尚非乐"
    },
    "506": {
        "rarity": "5",
        "name": "修"
    },
    "507": {
        "rarity": "5",
        "name": "凤无梦"
    },
    "508": {
        "rarity": "5",
        "name": "苏筱"
    },
    "510": {
        "rarity": "5",
        "name": "芙蕖"
    },
    "511": {
        "rarity": "5",
        "name": "司危"
    },
    "512": {
        "rarity": "5",
        "name": "白鸟梓"
    },
    "513": {
        "rarity": "5",
        "name": "无咎"
    },
    "514": {
        "rarity": "5",
        "name": "瓦卡莎"
    },
    "515": {
        "rarity": "5",
        "name": "卡洛琳"
    },
    "516": {
        "rarity": "5",
        "name": "阿棘"
    },
    "518": {
        "rarity": "5",
        "name": "雪长夏"
    },
    "525": {
        "rarity": "5",
        "name": "比戈尼娅"
    },
    "601": {
        "rarity": "6",
        "name": "卯绒绒"
    },
    "602": {
        "rarity": "6",
        "name": "岑缨"
    },
    "603": {
        "rarity": "6",
        "name": "伊琅相思"
    },
    "605": {
        "rarity": "6",
        "name": "龙晴"
    },
    "607": {
        "rarity": "6",
        "name": "瞳"
    },
    "608": {
        "rarity": "6",
        "name": "昊苍"
    },
    "610": {
        "rarity": "6",
        "name": "乐无异"
    },
    "611": {
        "rarity": "6",
        "name": "晴雪"
    },
    "612": {
        "rarity": "6",
        "name": "米达斯"
    },
    "613": {
        "rarity": "6",
        "name": "云无月"
    },
    "614": {
        "rarity": "6",
        "name": "北洛"
    },
    "615": {
        "rarity": "6",
        "name": "紫都"
    },
    "616": {
        "rarity": "6",
        "name": "崔远之"
    },
    "617": {
        "rarity": "6",
        "name": "莫红袖"
    },
    "618": {
        "rarity": "6",
        "name": "红玉"
    },
    "621": {
        "rarity": "6",
        "name": "耶芙娜"
    },
    "622": {
        "rarity": "6",
        "name": "言雀"
    },
    "623": {
        "rarity": "6",
        "name": "言御"
    },
    "624": {
        "rarity": "6",
        "name": "风晴雪"
    },
    "626": {
        "rarity": "6",
        "name": "百里屠苏"
    },
    "628": {
        "rarity": "6",
        "name": "鸢"
    },
    "630": {
        "rarity": "6",
        "name": "尤尼"
    },
    "631": {
        "rarity": "6",
        "name": "提提亚"
    },
    "632": {
        "rarity": "6",
        "name": "景"
    },
    "633": {
        "rarity": "6",
        "name": "缇诗"
    },
    "634": {
        "rarity": "6",
        "name": "明月尘"
    },
    "638": {
        "rarity": "6",
        "name": "林"
    },
    "642": {
        "rarity": "6",
        "name": "珑"
    },
}

const laohenConfig = {
    "1001": {
        "name": "樱华如梦",
        "rarity": "1"
    },
    "1002": {
        "name": "科技光辉",
        "rarity": "1"
    },
    "1003": {
        "name": "城市嚣音",
        "rarity": "1"
    },
    "1004": {
        "name": "落日残迹",
        "rarity": "1"
    },
    "1005": {
        "name": "旧巷",
        "rarity": "1"
    },
    "1006": {
        "name": "书卷晨曦",
        "rarity": "1"
    },
    "1007": {
        "name": "旧城夜幕",
        "rarity": "1"
    },
    "1008": {
        "name": "旖旎夜色",
        "rarity": "1"
    },
    "1009": {
        "name": "通道",
        "rarity": "1"
    },
    "1010": {
        "name": "归档",
        "rarity": "1"
    },
    "1011": {
        "name": "于人海中",
        "rarity": "1"
    },
    "1012": {
        "name": "万家灯火",
        "rarity": "1"
    },
    "1013": {
        "name": "混乱烟尘",
        "rarity": "1"
    },
    "1014": {
        "name": "甜蜜心绪",
        "rarity": "1"
    },
    "1015": {
        "name": "向阳",
        "rarity": "1"
    },
    "1016": {
        "name": "街市清晨",
        "rarity": "1"
    },
    "1017": {
        "name": "早日康复",
        "rarity": "1"
    },
    "1018": {
        "name": "千本之门",
        "rarity": "1"
    },
    "1019": {
        "name": "大隐于市",
        "rarity": "1"
    },
    "1020": {
        "name": "生死在握",
        "rarity": "1"
    },
    "1501": {
        "name": "「玄」学",
        "rarity": "2"
    },
    "1502": {
        "name": "你好，维瑟尔",
        "rarity": "2"
    },
    "1503": {
        "name": "化为千鹤",
        "rarity": "2"
    },
    "1504": {
        "name": "繁星记忆",
        "rarity": "2"
    },
    "1505": {
        "name": "世事难料",
        "rarity": "2"
    },
    "1506": {
        "name": "海临人的好奇心",
        "rarity": "2"
    },
    "1507": {
        "name": "秩序囚笼",
        "rarity": "2"
    },
    "1508": {
        "name": "增肌训练",
        "rarity": "2"
    },
    "1509": {
        "name": "不期而遇",
        "rarity": "2"
    },
    "1510": {
        "name": "白夜",
        "rarity": "2"
    },
    "1511": {
        "name": "精准控分",
        "rarity": "2"
    },
    "1512": {
        "name": "拂晓",
        "rarity": "2"
    },
    "1513": {
        "name": "代号「百草」",
        "rarity": "2"
    },
    "1514": {
        "name": "「家」",
        "rarity": "2"
    },
    "1515": {
        "name": "雨中愿",
        "rarity": "2"
    },
    "1516": {
        "name": "一枕酣甜",
        "rarity": "2"
    },
    "1517": {
        "name": "繁花蜃影",
        "rarity": "2"
    },
    "1518": {
        "name": "截稿日",
        "rarity": "2"
    },
    "1519": {
        "name": "流光竞夜",
        "rarity": "2"
    },
    "1520": {
        "name": "打成一片",
        "rarity": "2"
    },
    "1521": {
        "name": "流星坠处",
        "rarity": "2"
    },
    "1525": {
        "name": "团圆",
        "rarity": "2"
    },
    "1801": {
        "name": "秘密音律",
        "rarity": "2"
    },
    "1802": {
        "name": "意外邂逅",
        "rarity": "2"
    },
    "1803": {
        "name": "最好吃的朋友",
        "rarity": "2"
    },
    "1804": {
        "name": "「CAT vs. DOG」",
        "rarity": "2"
    },
    "1805": {
        "name": "泡影",
        "rarity": "2"
    },
    "1806": {
        "name": "记录一夏",
        "rarity": "2"
    },
    "1807": {
        "name": "奢梦",
        "rarity": "2"
    },
    "1901": {
        "name": "醒太平",
        "rarity": "2"
    },
    "1902": {
        "name": "圆锥曲线",
        "rarity": "2"
    },
    "1903": {
        "name": "速速降温",
        "rarity": "2"
    },
    "1904": {
        "name": "火热手感",
        "rarity": "2"
    },
    "1905": {
        "name": "飞驰海岸线",
        "rarity": "2"
    },
    "1906": {
        "name": "交换惊喜",
        "rarity": "2"
    },
    "1907": {
        "name": "调和清凉",
        "rarity": "2"
    },
    "1908": {
        "name": "假日余暇",
        "rarity": "2"
    },
    "2001": {
        "name": "同行",
        "rarity": "3"
    },
    "2002": {
        "name": "噩梦",
        "rarity": "3"
    },
    "2003": {
        "name": "夕阳挽歌",
        "rarity": "3"
    },
    "2004": {
        "name": "暗巷漆影",
        "rarity": "3"
    },
    "2005": {
        "name": "一线之隔",
        "rarity": "3"
    },
    "2006": {
        "name": "天陷",
        "rarity": "3"
    },
    "2007": {
        "name": "朗朗乾坤",
        "rarity": "3"
    },
    "2008": {
        "name": "血露薇·绝密",
        "rarity": "3"
    },
    "2009": {
        "name": "参商形影",
        "rarity": "3"
    },
    "2010": {
        "name": "雪轻日暖",
        "rarity": "3"
    },
    "2011": {
        "name": "偷偷「摩摩」",
        "rarity": "3"
    },
    "2012": {
        "name": "双重引力",
        "rarity": "3"
    },
    "2013": {
        "name": "旧友无多",
        "rarity": "3"
    },
    "2014": {
        "name": "藏锋",
        "rarity": "3"
    },
    "2015": {
        "name": "成长",
        "rarity": "3"
    },
    "2016": {
        "name": "残照",
        "rarity": "3"
    },
    "2017": {
        "name": "逐光者",
        "rarity": "3"
    },
    "2018": {
        "name": "「空」",
        "rarity": "3"
    },
    "2019": {
        "name": "恶土之花",
        "rarity": "3"
    },
    "2020": {
        "name": "最强召唤师",
        "rarity": "3"
    },
    "2021": {
        "name": "幻想彼境",
        "rarity": "3"
    },
    "2022": {
        "name": "光阴间隙",
        "rarity": "3"
    },
    "2023": {
        "name": "失途之日",
        "rarity": "3"
    },
    "2024": {
        "name": "于火光中「蛋」生",
        "rarity": "3"
    },
    "2025": {
        "name": "如在镜中",
        "rarity": "3"
    },
    "2026": {
        "name": "遇见宝石海",
        "rarity": "3"
    },
    "2027": {
        "name": "棺中鸟",
        "rarity": "3"
    },
    "2028": {
        "name": "底线大作战",
        "rarity": "3"
    },
    "2029": {
        "name": "天狼",
        "rarity": "3"
    },
    "2030": {
        "name": "千灯无间",
        "rarity": "3"
    },
    "2031": {
        "name": "怯者的墓志铭",
        "rarity": "3"
    },
    "2032": {
        "name": "野风",
        "rarity": "3"
    },
    "2033": {
        "name": "无罪之徒",
        "rarity": "3"
    },
    "2034": {
        "name": "潮湿前路",
        "rarity": "3"
    },
    "2038": {
        "name": "魇境边界",
        "rarity": "3"
    },
    "2039": {
        "name": "晓梦迷花",
        "rarity": "3"
    },
    "2801": {
        "name": "馆中遗影",
        "rarity": "3"
    },
    "2802": {
        "name": "庆典巡游",
        "rarity": "3"
    },
    "2803": {
        "name": "角色扮演",
        "rarity": "3"
    },
    "2804": {
        "name": "问卜天地",
        "rarity": "3"
    },
    "2805": {
        "name": "向新世界去",
        "rarity": "3"
    },
    "2806": {
        "name": "瞳中困影",
        "rarity": "3"
    },
    "2807": {
        "name": "千纪启明",
        "rarity": "3"
    },
    "2808": {
        "name": "曙色的地平线",
        "rarity": "3"
    },
    "2809": {
        "name": "浊雨",
        "rarity": "3"
    },
    "3001": {
        "name": "谎言之下",
        "rarity": "3"
    },
    "3002": {
        "name": "幕影重重",
        "rarity": "3"
    },
    "3003": {
        "name": "因果历然",
        "rarity": "3"
    },
    "3004": {
        "name": "烟尘往事",
        "rarity": "3"
    },
    "3005": {
        "name": "寂静昨日",
        "rarity": "3"
    },
    "3006": {
        "name": "月光下的告解",
        "rarity": "3"
    }
}

export { poolConfig, roleConfig, laohenConfig }