const poolConfig = {
    "1": {
        "type": "",
        "name": "常态共鸣",
        "up": ""
    },
    "2": {
        "type": "2",
        "name": "寻迹潜航",
        "up": ""
    },
    "3": {
        "type": "",
        "name": "常态共鸣·森罗万象",
        "up": ""
    },
    "4": {
        "type": "",
        "name": "常态共鸣·异世交汇",
        "up": ""
    },
    "5": {
        "type": "2",
        "name": "寻迹潜航·记忆回声",
        "up": ""
    },
    "6": {
        "type": "2",
        "name": "寻迹潜航·体质",
        "up": ""
    },
    "7": {
        "type": "2",
        "name": "寻迹潜航·防御",
        "up": ""
    },
    "8": {
        "type": "2",
        "name": "寻迹潜航·攻击",
        "up": ""
    },
    "9": {
        "type": "2",
        "name": "寻迹潜航·专精",
        "up": ""
    },
    "10": {
        "type": "2",
        "name": "寻迹潜航·终端",
        "up": ""
    },
    "100": {
        "type": "2",
        "name": "海域同游",
        "up": ""
    },
    "101": {
        "type": "1",
        "name": "限域巡回Ⅰ",/*商城十连必出6星礼包*/
        "up": "",
        "mustGet": true,
        "desc": "【68R十连必出6星礼包卡池，不参与数据统计】"
    },
    "102": {
        "type": "2",
        "name": "先觉潜航",
        "up": "",
        "limit": [
            {
                "name": "先觉潜航.林",
                "up": "",
                "startTime": "2024-12-05 04:00:00",
                "endTime": "2024-12-26 03:50:00"
            },
            {
                "name": "先觉潜航.玄戈",
                "up": "",
                "startTime": "2024-12-26 04:10:00",
                "endTime": "2025-01-16 03:50:00"
            },
            {
                "name": "先觉潜航.余音",
                "up": "",
                "startTime": "2025-01-16 10:00:00",
                "endTime": "2025-02-06 03:50:00"
            },
            {
                "name": "先觉潜航.十手卫",
                "up": "",
                "startTime": "2025-02-06 10:00:00",
                "endTime": "2025-02-27 03:50:00"
            },
            {
                "name": "先觉潜航.龙和",
                "up": "",
                "startTime": "2025-02-27 10:00:00",
                "endTime": "2025-03-20 03:50:00"
            },
            {
                "name": "先觉潜航.温留",
                "up": "",
                "startTime": "2025-03-20 10:00:00",
                "endTime": "2025-04-10 03:50:00"
            },
            {
                "name": "先觉潜航.茜茜",
                "up": "",
                "startTime": "2025-04-10 10:00:00",
                "endTime": "2025-05-01 03:50:00"
            },
            {
                "name": "先觉潜航.拉波",
                "up": "",
                "startTime": "2025-05-01 10:00:00",
                "endTime": "2025-05-22 03:50:00"
            },
            {
                "name": "先觉潜航.谛卡",
                "up": "",
                "startTime": "2025-05-22 10:00:00",
                "endTime": "2025-06-12 03:50:00"
            },
            {
                "name": "先觉潜航.司旸",
                "up": "",
                "startTime": "2025-06-12 10:00:00",
                "endTime": "2025-07-03 03:50:00"
            },
            {
                "name": "先觉潜航.言雀",
                "up": "",
                "startTime": "2025-07-03 10:00:00",
                "endTime": "2025-07-24 03:50:00"
            },
            {
                "name": "先觉潜航.织雪",
                "up": "",
                "startTime": "2025-07-24 10:00:00",
                "endTime": "2025-08-14 03:50:00"
            },
            {
                "name": "先觉潜航.百里屠苏",
                "up": "",
                "startTime": "2025-08-14 10:00:00",
                "endTime": "2025-09-04 03:50:00"
            }
        ]
    },
    "103": {
        "type": "1",
        "name": "限域巡回Ⅱ",/*商城十连必出6星礼包*/
        "up": "",
        "mustGet": true,
        "desc": "【150X晶石十连必出6星礼包卡池，不参与数据统计】"
    },
    "104": {
        "type": "1",
        "name": "联合共鸣",/*新的卡池*/
        "up": "",
        "limit": [
            {
                "name": "联合共鸣·底色",
                "up": "",
                "startTime": "2025-02-13 10:00:00",
                "endTime": "2025-03-06 03:50:00"
            },
            {
                "name": "联合共鸣·思维演绎",
                "up": "",
                "startTime": "2025-04-17 10:00:00",
                "endTime": "2025-05-08 03:50:00"
            },
        ]
    },
    "105": {
        "type": "1",
        "name": "联合共鸣",
        "up": "",
        "limit": [
            {
                "name": "联合共鸣·底色",
                "up": "",
                "startTime": "2025-02-13 10:00:00",
                "endTime": "2025-03-06 03:50:00"
            },
            {
                "name": "联合共鸣·思维演绎",
                "up": "",
                "startTime": "2025-04-17 10:00:00",
                "endTime": "2025-05-08 03:50:00"
            },
        ]
    },
    "3001": {
        "type": "1",
        "name": "阶梯·联合共鸣·Ⅰ",/*新的卡池*/
        "up": ""
    },
    "3002": {
        "type": "1",
        "name": "阶梯·联合共鸣·Ⅱ",/*新的卡池*/
        "up": ""
    },
    "3003": {
        "type": "1",
        "name": "阶梯·联合共鸣·Ⅲ",/*新的卡池*/
        "up": ""
    },
    "3004": {
        "type": "1",
        "name": "阶梯·联合共鸣·Ⅳ",/*新的卡池*/
        "up": ""
    },
    "3005": {
        "type": "1",
        "name": "阶梯·联合共鸣·二期·Ⅰ",/*新的卡池*/
        "up": ""
    },
    "3006": {
        "type": "1",
        "name": "阶梯·联合共鸣·二期·Ⅱ",/*新的卡池*/
        "up": ""
    },
    "3007": {
        "type": "1",
        "name": "阶梯·联合共鸣·二期·Ⅲ",/*新的卡池*/
        "up": ""
    },
    "3008": {
        "type": "1",
        "name": "阶梯·联合共鸣·二期·Ⅳ",/*新的卡池*/
        "up": ""
    },
    "1001": {
        "type": "2",
        "name": "限域巡回·潜航要约",
        "up": "",
        "mustGet": true,
        "desc": "【150X晶体十连必出SSR烙痕卡池，不参与数据统计】"
    },//150晶体十连烙痕选一
    "11": {
        "type": "",
        "name": "常态共鸣UP池",
        "up": "",
        "limit": [
            {
                "name": "常态共鸣.耶芙娜",
                "up": "耶芙娜",
                "startTime": "2024-01-12 07:00:00",
                "endTime": "2024-01-26 03:59:00"
            },
            {
                "name": "常态共鸣.红玉",
                "up": "红玉",
                "startTime": "2024-09-05 04:00:00",
                "endTime": "2024-09-19 03:50:00"
            },
            {
                "name": "常态共鸣.言御",
                "up": "言御",
                "startTime": "2024-09-26 04:00:00",
                "endTime": "2024-10-10 03:50:00"
            },
            {
                "name": "常态共鸣.言雀",
                "up": "言雀",
                "startTime": "2024-10-17 04:00:00",
                "endTime": "2024-10-31 03:50:00"
            },
            {
                "name": "常态共鸣.岑缨",
                "up": "岑缨",
                "startTime": "2024-11-07 04:00:00",
                "endTime": "2024-11-21 03:50:00"
            },
            {
                "name": "常态共鸣.鸢",
                "up": "鸢",
                "startTime": "2024-11-28 04:00:00",
                "endTime": "2024-12-12 03:50:00"
            },
            {
                "name": "常态共鸣.伊琅相思",
                "up": "伊琅相思",
                "startTime": "2024-12-19 04:00:00",
                "endTime": "2025-01-02 03:50:00"
            },
            {
                "name": "常态共鸣.红玉",
                "up": "红玉",
                "startTime": "2025-01-09 10:00:00",
                "endTime": "2025-01-23 03:50:00"
            },
            {
                "name": "常态共鸣.乐无异",
                "up": "乐无异",
                "startTime": "2025-01-30 10:00:00",
                "endTime": "2025-02-13 03:50:00"
            },
            {
                "name": "常态共鸣.晴雪",
                "up": "晴雪",
                "startTime": "2025-02-20 10:00:00",
                "endTime": "2025-03-06 03:50:00"
            },
            {
                "name": "常态共鸣.百里屠苏",
                "up": "百里屠苏",
                "startTime": "2025-03-13 10:00:00",
                "endTime": "2025-03-27 03:50:00"
            },
            {
                "name": "常态共鸣.明月尘",
                "up": "明月尘",
                "startTime": "2025-04-03 10:00:00",
                "endTime": "2025-04-17 03:50:00"
            },
            {
                "name": "常态共鸣.提提亚",
                "up": "提提亚",
                "startTime": "2025-04-24 10:00:00",
                "endTime": "2025-05-08 03:50:00"
            },
            {
                "name": "常态共鸣.景",
                "up": "景",
                "startTime": "2025-05-15 10:00:00",
                "endTime": "2025-05-29 03:50:00"
            },
            {
                "name": "常态共鸣.尤尼",
                "up": "尤尼",
                "startTime": "2025-06-05 10:00:00",
                "endTime": "2025-06-19 03:50:00"
            },
            {
                "name": "常态共鸣.伊琅相思",
                "up": "伊琅相思",
                "startTime": "2025-06-26 10:00:00",
                "endTime": "2025-07-10 03:50:00"
            },
            {
                "name": "常态共鸣.言御",
                "up": "言御",
                "startTime": "2025-07-17 10:00:00",
                "endTime": "2025-07-31 03:50:00"
            },
            {
                "name": "常态共鸣.明月尘",
                "up": "明月尘",
                "startTime": "2025-08-07 10:00:00",
                "endTime": "2025-08-21 03:50:00"
            }
        ]
    },
    "12": {
        "type": "1",
        "name": "游光澄明",
        "up": "岑缨"
    },
    "13": {
        "type": "2",
        "name": "于火光中「蛋」生",
        "up": "于火光中「蛋」生"
    },
    "14": {
        "type": "1",
        "name": "玉照长夜，陈酒新酌",
        "up": "红玉"
    },
    "15": {
        "type": "1",
        "name": "岁暮重明",
        "up": "百里屠苏"
    },
    "16": {
        "type": "2",
        "name": "失途之日",
        "up": "失途之日"
    },
    "17": {
        "type": "1",
        "name": "夜幕下的本相",
        "up": "言御"
    },
    "18": {
        "type": "1",
        "name": "云端来信",
        "up": "言雀"
    },
    "19": {
        "type": "2",
        "name": "幻想彼境",
        "up": "幻想彼境"
    },
    "20": {
        "type": "1",
        "name": "飞雪初晴",
        "up": "风晴雪"
    },
    "21": {
        "type": "1",
        "name": "王牌机械师",
        "up": "乐无异"
    },
    "22": {
        "type": "2",
        "name": "天狼",
        "up": "天狼"
    },
    "23": {
        "type": "2",
        "name": "底线大作战",
        "up": "底线大作战"
    },
    "24": {
        "type": "1",
        "name": "去往彼岸",
        "up": "伊琅相思"
    },
    "25": {
        "type": "2",
        "name": "光阴间隙",
        "up": "光阴间隙"
    },
    "26": {
        "type": "1",
        "name": "再见孤蓝之海",
        "up": "尤尼"
    },
    "27": {
        "type": "2",
        "name": "潮湿前路",
        "up": "潮湿前路"
    },
    "28": {
        "type": "1",
        "name": "沉默的祷言",
        "up": "鸢"
    },
    "29": {
        "type": "2",
        "name": "如在镜中",
        "up": "如在镜中"
    },
    "30": {
        "type": "1",
        "name": "常态共鸣·蚀",
        "up": ""/*云无月特殊卡池*/
    },
    "31": {
        "type": "1",
        "name": "本真枷锁",
        "up": "提提亚"
    },
    "32": {
        "type": "2",
        "name": "无罪之徒",
        "up": "无罪之徒"
    },
    "33": {
        "type": "1",
        "name": "荣耀俯首",
        "up": "景"
    },
    "34": {
        "type": "2",
        "name": "遇见宝石海",
        "up": "遇见宝石海"
    },
    "35": {
        "type": "1",
        "name": "晴空龙吟",
        "up": "晴雪"
    },
    "36": {
        "type": "2",
        "name": "晓梦迷花",
        "up": "晓梦迷花"
    },
    "37": {
        "type": "1",
        "name": "飞鸟也栖",
        "up": "明月尘"
    },
    "38": {
        "type": "2",
        "name": "棺中鸟",
        "up": "棺中鸟"
    },
    "39": {
        "type": "1",
        "name": "凡我之至",
        "up": "缇诗"
    },
    "40": {
        "type": "2",
        "name": "魇境边界",
        "up": "魇境边界"
    },
    "41": {
        "type": "1",
        "name": "荒土悲歌",
        "up": "米达斯"
    },
    "42": {
        "type": "2",
        "name": "怯者的墓志铭",
        "up": "怯者的墓志铭"
    },
    "43": {
        "type": "1",
        "name": "振玉知微",
        "up": "珑"
    },
    "44": {
        "type": "2",
        "name": "千灯无间",
        "up": "千灯无间"
    },
    "45": {
        "type": "1",
        "name": "渊火伏明",
        "up": "林"
    },
    "46": {
        "type": "2",
        "name": "野风",
        "up": "野风"
    },
    "47": {
        "type": "1",
        "name": "日暮寻路",
        "up": "北洛"
    },
    "48": {
        "type": "1",
        "name": "灼金格言",
        "up": "玄戈"
    },
    "49": {
        "type": "2",
        "name": "「默」",
        "up": "「默」"
    },
    "50": {
        "type": "1",
        "name": "空心人",
        "up": "余音"
    },
    "51": {
        "type": "2",
        "name": "神·迹",
        "up": "神·迹"
    },
    "52": {
        "type": "1",
        "name": "至暗至明",
        "up": "十手卫"
    },
    "53": {
        "type": "2",
        "name": "须臾浮生",
        "up": "须臾浮生"
    },
    "54": {
        "type": "1",
        "name": "潮生流火",
        "up": "龙和"
    },
    "55": {
        "type": "2",
        "name": "泅游",
        "up": "泅游"
    },
    "56": {
        "type": "1",
        "name": "瑞金游方",
        "up": "温留"
    },
    "57": {
        "type": "2",
        "name": "新醅",
        "up": "新醅"
    },
    "58": {
        "type": "1",
        "name": "柙中独白",
        "up": "茜茜"
    },
    "59": {
        "type": "2",
        "name": "欢声萦回",
        "up": "欢声萦回"
    },
    "60": {
        "type": "1",
        "name": "二分的狂徒",
        "up": "拉波"
    },
    "61": {
        "type": "2",
        "name": "形与神",
        "up": "形与神"
    },
    "62": {
        "type": "1",
        "name": "是，主厨！",
        "up": "谛卡"
    },
    "63": {
        "type": "2",
        "name": "沙中金火",
        "up": "沙中金火"
    },
    "64": {
        "type": "1",
        "name": "第三种诘问",
        "up": "司旸"
    },
    "65": {
        "type": "2",
        "name": "失罪夜",
        "up": "失罪夜"
    },
    "66": {
        "type": "1",
        "name": "云端来信",
        "up": "言雀"
    },
    "67": {
        "type": "2",
        "name": "堕入星尘",
        "up": "堕入星尘"
    },
    "68": {
        "type": "1",
        "name": "裁梦刀",
        "up": "织雪"
    },
    "69": {
        "type": "2",
        "name": "局外人",
        "up": "局外人"
    },
    "70": {
        "type": "1",
        "name": "岁暮重明",
        "up": "百里屠苏"
    },
    "71": {
        "type": "2",
        "name": "洗出汪外",
        "up": "洗出汪外"
    },
    "5001": {
        "type": "1",
        "name": "识海甄录",//自选卡池
        "up": "",
        "limit": [
            {
                "name": "识海甄录·消夏归航(自选卡池)",
                "up": "",
                "startTime": "2025-05-01 04:00:00",
                "endTime": "2025-07-24 03:50:00"
            }
        ]
    },
    "10001": {
        "type": "1",
        "name": "既定回响·一",
        "up": ""
    },
    "10002": {
        "type": "1",
        "name": "既定回响·二",
        "up": ""
    },
    "10003": {
        "type": "1",
        "name": "既定回响·三",
        "up": ""
    },
    "10004": {
        "type": "1",
        "name": "既定回响·四",
        "up": ""
    },
    "10005": {
        "type": "1",
        "name": "既定回响·五",
        "up": ""
    },
    "10006": {
        "type": "1",
        "name": "既定回响·六",
        "up": ""
    },
    "10007": {
        "type": "1",
        "name": "既定回响·七",
        "up": ""
    },
    "10008": {
        "type": "1",
        "name": "既定回响·八",
        "up": ""
    },
    "10009": {
        "type": "1",
        "name": "既定回响·九",
        "up": ""
    },
    "10010": {
        "type": "1",
        "name": "既定回响·十",
        "up": ""
    },
    "10011": {
        "type": "1",
        "name": "既定回响·十一",
        "up": ""
    }
}

const roleConfig = {
    "101": {
        "rarity": "1",
        "name": "老板"
    },
    "102": {
        "rarity": "1",
        "name": "Sweeper-EX"
    },
    "201": {
        "rarity": "1",
        "name": "豹富"
    },
    "301": {
        "rarity": "4",
        "name": "田偌"
    },
    "302": {
        "rarity": "4",
        "name": "艾摩诃"
    },
    "303": {
        "rarity": "4",
        "name": "元桃桃"
    },
    "304": {
        "rarity": "4",
        "name": "霍冉"
    },
    "306": {
        "rarity": "4",
        "name": "狄砚"
    },
    "401": {
        "rarity": "4",
        "name": "刘兄"
    },
    "402": {
        "rarity": "4",
        "name": "马尔斯"
    },
    "403": {
        "rarity": "4",
        "name": "长谣"
    },
    "404": {
        "rarity": "4",
        "name": "唐路遥"
    },
    "405": {
        "rarity": "4",
        "name": "焰响"
    },
    "406": {
        "rarity": "4",
        "name": "赫九逸"
    },
    "407": {
        "rarity": "5",
        "name": "莉缇亚"
    },
    "409": {
        "rarity": "5",
        "name": "吉娜"
    },
    "410": {
        "rarity": "4",
        "name": "岚岚"
    },
    "501": {
        "rarity": "5",
        "name": "襄铃"
    },
    "502": {
        "rarity": "5",
        "name": "罗咤"
    },
    "503": {
        "rarity": "5",
        "name": "阳铃"
    },
    "504": {
        "rarity": "5",
        "name": "禺期"
    },
    "505": {
        "rarity": "5",
        "name": "尚非乐"
    },
    "506": {
        "rarity": "5",
        "name": "修"
    },
    "507": {
        "rarity": "5",
        "name": "凤无梦"
    },
    "508": {
        "rarity": "5",
        "name": "苏筱"
    },
    "510": {
        "rarity": "5",
        "name": "芙蕖"
    },
    "511": {
        "rarity": "5",
        "name": "司危"
    },
    "512": {
        "rarity": "5",
        "name": "白鸟梓"
    },
    "513": {
        "rarity": "5",
        "name": "无咎"
    },
    "514": {
        "rarity": "5",
        "name": "瓦卡莎"
    },
    "515": {
        "rarity": "5",
        "name": "卡洛琳"
    },
    "516": {
        "rarity": "5",
        "name": "阿棘"
    },
    "518": {
        "rarity": "5",
        "name": "雪长夏"
    },
    "525": {
        "rarity": "5",
        "name": "比戈尼娅"
    },
    "601": {
        "rarity": "6",
        "name": "卯绒绒"
    },
    "602": {
        "rarity": "6",
        "name": "岑缨"
    },
    "603": {
        "rarity": "6",
        "name": "伊琅相思"
    },
    "605": {
        "rarity": "6",
        "name": "龙晴"
    },
    "607": {
        "rarity": "6",
        "name": "瞳"
    },
    "608": {
        "rarity": "6",
        "name": "昊苍"
    },
    "610": {
        "rarity": "6",
        "name": "乐无异"
    },
    "611": {
        "rarity": "6",
        "name": "晴雪"
    },
    "612": {
        "rarity": "6",
        "name": "米达斯"
    },
    "613": {
        "rarity": "6",
        "name": "云无月"
    },
    "614": {
        "rarity": "6",
        "name": "北洛"
    },
    "615": {
        "rarity": "6",
        "name": "紫都"
    },
    "616": {
        "rarity": "6",
        "name": "崔远之"
    },
    "617": {
        "rarity": "6",
        "name": "莫红袖"
    },
    "618": {
        "rarity": "6",
        "name": "红玉"
    },
    "621": {
        "rarity": "6",
        "name": "耶芙娜"
    },
    "622": {
        "rarity": "6",
        "name": "言雀"
    },
    "623": {
        "rarity": "6",
        "name": "言御"
    },
    "624": {
        "rarity": "6",
        "name": "风晴雪"
    },
    "626": {
        "rarity": "6",
        "name": "百里屠苏"
    },
    "628": {
        "rarity": "6",
        "name": "鸢"
    },
    "630": {
        "rarity": "6",
        "name": "尤尼"
    },
    "631": {
        "rarity": "6",
        "name": "提提亚"
    },
    "632": {
        "rarity": "6",
        "name": "景"
    },
    "633": {
        "rarity": "6",
        "name": "缇诗"
    },
    "634": {
        "rarity": "6",
        "name": "明月尘"
    },
    "638": {
        "rarity": "6",
        "name": "林"
    },
    "642": {
        "rarity": "6",
        "name": "珑"
    },
    "643": {
        "rarity": "6",
        "name": "十手卫"
    },
    "645": {
        "rarity": "6",
        "name": "玄戈"
    },
    "646": {
        "rarity": "6",
        "name": "余音"
    },
    "647": {
        "rarity": "6",
        "name": "龙和"
    },
    "648": {
        "rarity": "6",
        "name": "温留"
    },
    "649": {
        "rarity": "6",
        "name": "拉波"
    },
    "650": {
        "rarity": "6",
        "name": "茜茜"
    },
    "651": {
        "rarity": "6",
        "name": "司旸"
    },
    "652": {
        "rarity": "6",
        "name": "谛卡"
    },
}

const laohenConfig = {
    "1001": {
        "name": "樱华如梦",
        "rarity": "1"
    },
    "1002": {
        "name": "科技光辉",
        "rarity": "1"
    },
    "1003": {
        "name": "城市嚣音",
        "rarity": "1"
    },
    "1004": {
        "name": "落日残迹",
        "rarity": "1"
    },
    "1005": {
        "name": "旧巷",
        "rarity": "1"
    },
    "1006": {
        "name": "书卷晨曦",
        "rarity": "1"
    },
    "1007": {
        "name": "旧城夜幕",
        "rarity": "1"
    },
    "1008": {
        "name": "旖旎夜色",
        "rarity": "1"
    },
    "1009": {
        "name": "通道",
        "rarity": "1"
    },
    "1010": {
        "name": "归档",
        "rarity": "1"
    },
    "1011": {
        "name": "于人海中",
        "rarity": "1"
    },
    "1012": {
        "name": "万家灯火",
        "rarity": "1"
    },
    "1013": {
        "name": "混乱烟尘",
        "rarity": "1"
    },
    "1014": {
        "name": "甜蜜心绪",
        "rarity": "1"
    },
    "1015": {
        "name": "向阳",
        "rarity": "1"
    },
    "1016": {
        "name": "街市清晨",
        "rarity": "1"
    },
    "1017": {
        "name": "早日康复",
        "rarity": "1"
    },
    "1018": {
        "name": "千本之门",
        "rarity": "1"
    },
    "1019": {
        "name": "大隐于市",
        "rarity": "1"
    },
    "1020": {
        "name": "生死在握",
        "rarity": "1"
    },
    "1501": {
        "name": "「玄」学",
        "rarity": "2"
    },
    "1502": {
        "name": "你好，维瑟尔",
        "rarity": "2"
    },
    "1503": {
        "name": "化为千鹤",
        "rarity": "2"
    },
    "1504": {
        "name": "繁星记忆",
        "rarity": "2"
    },
    "1505": {
        "name": "世事难料",
        "rarity": "2"
    },
    "1506": {
        "name": "海临人的好奇心",
        "rarity": "2"
    },
    "1507": {
        "name": "秩序囚笼",
        "rarity": "2"
    },
    "1508": {
        "name": "增肌训练",
        "rarity": "2"
    },
    "1509": {
        "name": "不期而遇",
        "rarity": "2"
    },
    "1510": {
        "name": "白夜",
        "rarity": "2"
    },
    "1511": {
        "name": "精准控分",
        "rarity": "2"
    },
    "1512": {
        "name": "拂晓",
        "rarity": "2"
    },
    "1513": {
        "name": "代号「百草」",
        "rarity": "2"
    },
    "1514": {
        "name": "「家」",
        "rarity": "2"
    },
    "1515": {
        "name": "雨中愿",
        "rarity": "2"
    },
    "1516": {
        "name": "一枕酣甜",
        "rarity": "2"
    },
    "1517": {
        "name": "繁花蜃影",
        "rarity": "2"
    },
    "1518": {
        "name": "截稿日",
        "rarity": "2"
    },
    "1519": {
        "name": "流光竞夜",
        "rarity": "2"
    },
    "1520": {
        "name": "打成一片",
        "rarity": "2"
    },
    "1521": {
        "name": "流星坠处",
        "rarity": "2"
    },
    "1525": {
        "name": "团圆",
        "rarity": "2"
    },
    "1801": {
        "name": "秘密音律",
        "rarity": "2"
    },
    "1802": {
        "name": "意外邂逅",
        "rarity": "2"
    },
    "1803": {
        "name": "最好吃的朋友",
        "rarity": "2"
    },
    "1804": {
        "name": "「CAT vs. DOG」",
        "rarity": "2"
    },
    "1805": {
        "name": "泡影",
        "rarity": "2"
    },
    "1806": {
        "name": "记录一夏",
        "rarity": "2"
    },
    "1807": {
        "name": "奢梦",
        "rarity": "2"
    },
    "1808": {
        "name": "未晞",
        "rarity": "2"
    },
    "1809": {
        "name": "度晴波",
        "rarity": "2"
    },
    "1810": {
        "name": "TARGET ERROR",
        "rarity": "2"
    },
    "1811": {
        "name": "问天",
        "rarity": "2"
    },
    "1901": {
        "name": "醒太平",
        "rarity": "2"
    },
    "1902": {
        "name": "圆锥曲线",
        "rarity": "2"
    },
    "1903": {
        "name": "速速降温",
        "rarity": "2"
    },
    "1904": {
        "name": "火热手感",
        "rarity": "2"
    },
    "1905": {
        "name": "飞驰海岸线",
        "rarity": "2"
    },
    "1906": {
        "name": "交换惊喜",
        "rarity": "2"
    },
    "1907": {
        "name": "调和清凉",
        "rarity": "2"
    },
    "1908": {
        "name": "假日余暇",
        "rarity": "2"
    },
    "2001": {
        "name": "同行",
        "rarity": "3"
    },
    "2002": {
        "name": "噩梦",
        "rarity": "3"
    },
    "2003": {
        "name": "夕阳挽歌",
        "rarity": "3"
    },
    "2004": {
        "name": "暗巷漆影",
        "rarity": "3"
    },
    "2005": {
        "name": "一线之隔",
        "rarity": "3"
    },
    "2006": {
        "name": "天陷",
        "rarity": "3"
    },
    "2007": {
        "name": "朗朗乾坤",
        "rarity": "3"
    },
    "2008": {
        "name": "血露薇·绝密",
        "rarity": "3"
    },
    "2009": {
        "name": "参商形影",
        "rarity": "3"
    },
    "2010": {
        "name": "雪轻日暖",
        "rarity": "3"
    },
    "2011": {
        "name": "偷偷「摩摩」",
        "rarity": "3"
    },
    "2012": {
        "name": "双重引力",
        "rarity": "3"
    },
    "2013": {
        "name": "旧友无多",
        "rarity": "3"
    },
    "2014": {
        "name": "藏锋",
        "rarity": "3"
    },
    "2015": {
        "name": "成长",
        "rarity": "3"
    },
    "2016": {
        "name": "残照",
        "rarity": "3"
    },
    "2017": {
        "name": "逐光者",
        "rarity": "3"
    },
    "2018": {
        "name": "「空」",
        "rarity": "3"
    },
    "2019": {
        "name": "恶土之花",
        "rarity": "3"
    },
    "2020": {
        "name": "最强召唤师",
        "rarity": "3"
    },
    "2021": {
        "name": "幻想彼境",
        "rarity": "3"
    },
    "2022": {
        "name": "光阴间隙",
        "rarity": "3"
    },
    "2023": {
        "name": "失途之日",
        "rarity": "3"
    },
    "2024": {
        "name": "于火光中「蛋」生",
        "rarity": "3"
    },
    "2025": {
        "name": "如在镜中",
        "rarity": "3"
    },
    "2026": {
        "name": "遇见宝石海",
        "rarity": "3"
    },
    "2027": {
        "name": "棺中鸟",
        "rarity": "3"
    },
    "2028": {
        "name": "底线大作战",
        "rarity": "3"
    },
    "2029": {
        "name": "天狼",
        "rarity": "3"
    },
    "2030": {
        "name": "千灯无间",
        "rarity": "3"
    },
    "2031": {
        "name": "怯者的墓志铭",
        "rarity": "3"
    },
    "2032": {
        "name": "野风",
        "rarity": "3"
    },
    "2033": {
        "name": "无罪之徒",
        "rarity": "3"
    },
    "2034": {
        "name": "潮湿前路",
        "rarity": "3"
    },
    "2035": {
        "name": "欢声萦回",
        "rarity": "3"
    },
    "2036": {
        "name": "须臾浮生",
        "rarity": "3"
    },
    "2037": {
        "name": "泅游",
        "rarity": "3"
    },
    "2038": {
        "name": "魇境边界",
        "rarity": "3"
    },
    "2039": {
        "name": "晓梦迷花",
        "rarity": "3"
    },
    "2040": {
        "name": "堕入星尘",
        "rarity": "3"
    },
    "2042": {
        "name": "沙中金火",
        "rarity": "3"
    },
    "2043": {
        "name": "神·迹",
        "rarity": "3"
    },
    "2044": {
        "name": "「默」",
        "rarity": "3"
    },
    "2048": {
        "name": "新醅",
        "rarity": "3"
    },
    "2049": {
        "name": "形与神",
        "rarity": "3"
    },
    "2054": {
        "name": "失罪夜",
        "rarity": "3"
    },
    "2801": {
        "name": "馆中遗影",
        "rarity": "3"
    },
    "2802": {
        "name": "庆典巡游",
        "rarity": "3"
    },
    "2803": {
        "name": "角色扮演",
        "rarity": "3"
    },
    "2804": {
        "name": "问卜天地",
        "rarity": "3"
    },
    "2805": {
        "name": "向新世界去",
        "rarity": "3"
    },
    "2806": {
        "name": "瞳中困影",
        "rarity": "3"
    },
    "2807": {
        "name": "千纪启明",
        "rarity": "3"
    },
    "2808": {
        "name": "曙色的地平线",
        "rarity": "3"
    },
    "2809": {
        "name": "浊雨",
        "rarity": "3"
    },
    "2810": {
        "name": "Feat",
        "rarity": "3"
    },
    "2811": {
        "name": "执愿",
        "rarity": "3"
    },
    "3001": {
        "name": "谎言之下",
        "rarity": "3"
    },
    "3002": {
        "name": "幕影重重",
        "rarity": "3"
    },
    "3003": {
        "name": "因果历然",
        "rarity": "3"
    },
    "3004": {
        "name": "烟尘往事",
        "rarity": "3"
    },
    "3005": {
        "name": "寂静昨日",
        "rarity": "3"
    },
    "3006": {
        "name": "月光下的告解",
        "rarity": "3"
    },
    "3007": {
        "name": "暗涌轮廓",
        "rarity": "3"
    }
}

export { poolConfig, roleConfig, laohenConfig }