export const poolConfig = {
    "1": {
        "type": "",
        "name": "常态共鸣",
        "up": ""
    },
    "2": {
        "type": "2",
        "name": "寻迹潜航",
        "up": ""
    },
    "3": {
        "type": "",
        "name": "常态共鸣·森罗万象",
        "up": ""
    },
    "4": {
        "type": "",
        "name": "常态共鸣·异世交汇",
        "up": ""
    },
    "5": {
        "type": "2",
        "name": "寻迹潜航·记忆回声",
        "up": ""
    },
    "6": {
        "type": "2",
        "name": "寻迹潜航·体质",
        "up": ""
    },
    "7": {
        "type": "2",
        "name": "寻迹潜航·防御",
        "up": ""
    },
    "8": {
        "type": "2",
        "name": "寻迹潜航·攻击",
        "up": ""
    },
    "9": {
        "type": "2",
        "name": "寻迹潜航·专精",
        "up": ""
    },
    "10": {
        "type": "2",
        "name": "寻迹潜航·终端",
        "up": ""
    },
    "100": {
        "type": "2",
        "name": "海域同游",
        "up": ""
    },
    "101": {
        "type": "1",
        "name": "限域巡回Ⅰ",/*商城十连必出6星礼包*/
        "up": "",
        "mustGet": true,
        "desc": "【68R十连必出6星礼包卡池，不参与数据统计】"
    },
    "102": {
        "type": "2",
        "name": "先觉潜航",
        "up": "",
        "limit": [
            {
                "name": "先觉潜航.林",
                "up": "",
                "startTime": "2024-12-05 04:00:00",
                "endTime": "2024-12-26 03:50:00"
            },
            {
                "name": "先觉潜航.玄戈",
                "up": "",
                "startTime": "2024-12-26 04:10:00",
                "endTime": "2025-01-16 03:50:00"
            },
            {
                "name": "先觉潜航.余音",
                "up": "",
                "startTime": "2025-01-16 10:00:00",
                "endTime": "2025-02-06 03:50:00"
            },
            {
                "name": "先觉潜航.十手卫",
                "up": "",
                "startTime": "2025-02-06 10:00:00",
                "endTime": "2025-02-27 03:50:00"
            },
            {
                "name": "先觉潜航.龙和",
                "up": "",
                "startTime": "2025-02-27 10:00:00",
                "endTime": "2025-03-20 03:50:00"
            },
            {
                "name": "先觉潜航.温留",
                "up": "",
                "startTime": "2025-03-20 10:00:00",
                "endTime": "2025-04-10 03:50:00"
            },
            {
                "name": "先觉潜航.茜茜",
                "up": "",
                "startTime": "2025-04-10 10:00:00",
                "endTime": "2025-05-01 03:50:00"
            },
            {
                "name": "先觉潜航.拉波",
                "up": "",
                "startTime": "2025-05-01 10:00:00",
                "endTime": "2025-05-22 03:50:00"
            },
            {
                "name": "先觉潜航.谛卡",
                "up": "",
                "startTime": "2025-05-22 10:00:00",
                "endTime": "2025-06-12 03:50:00"
            },
            {
                "name": "先觉潜航.司旸",
                "up": "",
                "startTime": "2025-06-12 10:00:00",
                "endTime": "2025-07-03 03:50:00"
            },
            {
                "name": "先觉潜航.言雀",
                "up": "",
                "startTime": "2025-07-03 10:00:00",
                "endTime": "2025-07-24 03:50:00"
            },
            {
                "name": "先觉潜航.织雪",
                "up": "",
                "startTime": "2025-07-24 10:00:00",
                "endTime": "2025-08-14 03:50:00"
            },
            {
                "name": "先觉潜航.百里屠苏",
                "up": "",
                "startTime": "2025-08-14 10:00:00",
                "endTime": "2025-09-04 03:50:00"
            },
            {
                "name": "先觉潜航.逸虚",
                "up": "",
                "startTime": "2025-09-04 10:00:00",
                "endTime": "2025-09-25 03:50:00"
            },
            {
                "name": "先觉潜航·风晴雪 紫都",
                "up": "",
                "startTime": "2025-09-25 10:00:00",
                "endTime": "2025-10-16 03:50:00"
            },
            {
                "name": "先觉潜航·红珠小姐",
                "up": "",
                "startTime": "2025-10-16 10:00:00",
                "endTime": "2025-11-06 03:50:00"
            },
            {
                "name": "先觉潜航·米达斯 崔远之",
                "up": "",
                "startTime": "2025-11-06 10:00:00",
                "endTime": "2025-11-27 03:50:00"
            }
        ]
    },
    "103": {
        "type": "1",
        "name": "限域巡回Ⅱ",/*商城十连必出6星礼包*/
        "up": "",
        "mustGet": true,
        "desc": "【150X晶石十连必出6星礼包卡池，不参与数据统计】"
    },
    "104": {
        "type": "1",
        "name": "联合共鸣",/*新的卡池*/
        "up": "",
        "limit": [
            {
                "name": "联合共鸣·底色",
                "up": "",
                "startTime": "2025-02-13 10:00:00",
                "endTime": "2025-03-06 03:50:00"
            },
            {
                "name": "联合共鸣·思维演绎",
                "up": "",
                "startTime": "2025-04-17 10:00:00",
                "endTime": "2025-05-08 03:50:00"
            },
        ]
    },
    "105": {
        "type": "1",
        "name": "联合共鸣",
        "up": "",
        "limit": [
            {
                "name": "联合共鸣·底色",
                "up": "",
                "startTime": "2025-02-13 10:00:00",
                "endTime": "2025-03-06 03:50:00"
            },
            {
                "name": "联合共鸣·思维演绎",
                "up": "",
                "startTime": "2025-04-17 10:00:00",
                "endTime": "2025-05-08 03:50:00"
            },
        ]
    },
    "3001": {
        "type": "1",
        "name": "阶梯·联合共鸣·Ⅰ",/*新的卡池*/
        "up": ""
    },
    "3002": {
        "type": "1",
        "name": "阶梯·联合共鸣·Ⅱ",/*新的卡池*/
        "up": ""
    },
    "3003": {
        "type": "1",
        "name": "阶梯·联合共鸣·Ⅲ",/*新的卡池*/
        "up": ""
    },
    "3004": {
        "type": "1",
        "name": "阶梯·联合共鸣·Ⅳ",/*新的卡池*/
        "up": ""
    },
    "3005": {
        "type": "1",
        "name": "阶梯·联合共鸣·二期·Ⅰ",/*新的卡池*/
        "up": ""
    },
    "3006": {
        "type": "1",
        "name": "阶梯·联合共鸣·二期·Ⅱ",/*新的卡池*/
        "up": ""
    },
    "3007": {
        "type": "1",
        "name": "阶梯·联合共鸣·二期·Ⅲ",/*新的卡池*/
        "up": ""
    },
    "3008": {
        "type": "1",
        "name": "阶梯·联合共鸣·二期·Ⅳ",/*新的卡池*/
        "up": ""
    },
    "1001": {
        "type": "2",
        "name": "限域巡回·潜航要约",
        "up": "",
        "mustGet": true,
        "desc": "【150X晶体十连必出SSR烙痕卡池，不参与数据统计】"
    },//150晶体十连烙痕选一
    "11": {
        "type": "",
        "name": "常态共鸣UP池",
        "up": "",
        "limit": [
            {
                "name": "常态共鸣.耶芙娜",
                "up": "耶芙娜",
                "startTime": "2024-01-12 07:00:00",
                "endTime": "2024-01-26 03:59:00"
            },
            {
                "name": "常态共鸣.红玉",
                "up": "红玉",
                "startTime": "2024-09-05 04:00:00",
                "endTime": "2024-09-19 03:50:00"
            },
            {
                "name": "常态共鸣.言御",
                "up": "言御",
                "startTime": "2024-09-26 04:00:00",
                "endTime": "2024-10-10 03:50:00"
            },
            {
                "name": "常态共鸣.言雀",
                "up": "言雀",
                "startTime": "2024-10-17 04:00:00",
                "endTime": "2024-10-31 03:50:00"
            },
            {
                "name": "常态共鸣.岑缨",
                "up": "岑缨",
                "startTime": "2024-11-07 04:00:00",
                "endTime": "2024-11-21 03:50:00"
            },
            {
                "name": "常态共鸣.鸢",
                "up": "鸢",
                "startTime": "2024-11-28 04:00:00",
                "endTime": "2024-12-12 03:50:00"
            },
            {
                "name": "常态共鸣.伊琅相思",
                "up": "伊琅相思",
                "startTime": "2024-12-19 04:00:00",
                "endTime": "2025-01-02 03:50:00"
            },
            {
                "name": "常态共鸣.红玉",
                "up": "红玉",
                "startTime": "2025-01-09 10:00:00",
                "endTime": "2025-01-23 03:50:00"
            },
            {
                "name": "常态共鸣.乐无异",
                "up": "乐无异",
                "startTime": "2025-01-30 10:00:00",
                "endTime": "2025-02-13 03:50:00"
            },
            {
                "name": "常态共鸣.晴雪",
                "up": "晴雪",
                "startTime": "2025-02-20 10:00:00",
                "endTime": "2025-03-06 03:50:00"
            },
            {
                "name": "常态共鸣.百里屠苏",
                "up": "百里屠苏",
                "startTime": "2025-03-13 10:00:00",
                "endTime": "2025-03-27 03:50:00"
            },
            {
                "name": "常态共鸣.明月尘",
                "up": "明月尘",
                "startTime": "2025-04-03 10:00:00",
                "endTime": "2025-04-17 03:50:00"
            },
            {
                "name": "常态共鸣.提提亚",
                "up": "提提亚",
                "startTime": "2025-04-24 10:00:00",
                "endTime": "2025-05-08 03:50:00"
            },
            {
                "name": "常态共鸣.景",
                "up": "景",
                "startTime": "2025-05-15 10:00:00",
                "endTime": "2025-05-29 03:50:00"
            },
            {
                "name": "常态共鸣.尤尼",
                "up": "尤尼",
                "startTime": "2025-06-05 10:00:00",
                "endTime": "2025-06-19 03:50:00"
            },
            {
                "name": "常态共鸣.伊琅相思",
                "up": "伊琅相思",
                "startTime": "2025-06-26 10:00:00",
                "endTime": "2025-07-10 03:50:00"
            },
            {
                "name": "常态共鸣.言御",
                "up": "言御",
                "startTime": "2025-07-17 10:00:00",
                "endTime": "2025-07-31 03:50:00"
            },
            {
                "name": "常态共鸣.明月尘",
                "up": "明月尘",
                "startTime": "2025-08-07 10:00:00",
                "endTime": "2025-08-21 03:50:00"
            },
            {
                "name": "常态共鸣.红玉",
                "up": "红玉",
                "startTime": "2025-08-28 10:00:00",
                "endTime": "2025-09-11 03:50:00"
            },
            {
                "name": "常态共鸣.岑缨",
                "up": "岑缨",
                "startTime": "2025-09-18 10:00:00",
                "endTime": "2025-10-02 03:50:00"
            },
            {
                "name": "常态共鸣.鸢",
                "up": "鸢",
                "startTime": "2025-10-09 10:00:00",
                "endTime": "2025-10-23 03:50:00"
            },
            {
                "name": "常态共鸣.云无月",
                "up": "云无月",
                "startTime": "2025-10-30 10:00:00",
                "endTime": "2025-11-13 03:50:00"
            }
        ]
    },
    "12": {
        "type": "1",
        "name": "游光澄明",
        "up": "岑缨"
    },
    "13": {
        "type": "2",
        "name": "于火光中「蛋」生",
        "up": "于火光中「蛋」生"
    },
    "14": {
        "type": "1",
        "name": "玉照长夜，陈酒新酌",
        "up": "红玉"
    },
    "15": {
        "type": "1",
        "name": "岁暮重明",
        "up": "百里屠苏"
    },
    "16": {
        "type": "2",
        "name": "失途之日",
        "up": "失途之日"
    },
    "17": {
        "type": "1",
        "name": "夜幕下的本相",
        "up": "言御"
    },
    "18": {
        "type": "1",
        "name": "云端来信",
        "up": "言雀"
    },
    "19": {
        "type": "2",
        "name": "幻想彼境",
        "up": "幻想彼境"
    },
    "20": {
        "type": "1",
        "name": "飞雪初晴",
        "up": "风晴雪"
    },
    "21": {
        "type": "1",
        "name": "王牌机械师",
        "up": "乐无异"
    },
    "22": {
        "type": "2",
        "name": "天狼",
        "up": "天狼"
    },
    "23": {
        "type": "2",
        "name": "底线大作战",
        "up": "底线大作战"
    },
    "24": {
        "type": "1",
        "name": "去往彼岸",
        "up": "伊琅相思"
    },
    "25": {
        "type": "2",
        "name": "光阴间隙",
        "up": "光阴间隙"
    },
    "26": {
        "type": "1",
        "name": "再见孤蓝之海",
        "up": "尤尼"
    },
    "27": {
        "type": "2",
        "name": "潮湿前路",
        "up": "潮湿前路"
    },
    "28": {
        "type": "1",
        "name": "沉默的祷言",
        "up": "鸢"
    },
    "29": {
        "type": "2",
        "name": "如在镜中",
        "up": "如在镜中"
    },
    "30": {
        "type": "1",
        "name": "常态共鸣·蚀",
        "up": ""/*云无月特殊卡池*/
    },
    "31": {
        "type": "1",
        "name": "本真枷锁",
        "up": "提提亚"
    },
    "32": {
        "type": "2",
        "name": "无罪之徒",
        "up": "无罪之徒"
    },
    "33": {
        "type": "1",
        "name": "荣耀俯首",
        "up": "景"
    },
    "34": {
        "type": "2",
        "name": "遇见宝石海",
        "up": "遇见宝石海"
    },
    "35": {
        "type": "1",
        "name": "晴空龙吟",
        "up": "晴雪"
    },
    "36": {
        "type": "2",
        "name": "晓梦迷花",
        "up": "晓梦迷花"
    },
    "37": {
        "type": "1",
        "name": "飞鸟也栖",
        "up": "明月尘"
    },
    "38": {
        "type": "2",
        "name": "棺中鸟",
        "up": "棺中鸟"
    },
    "39": {
        "type": "1",
        "name": "凡我之至",
        "up": "缇诗"
    },
    "40": {
        "type": "2",
        "name": "魇境边界",
        "up": "魇境边界"
    },
    "41": {
        "type": "1",
        "name": "荒土悲歌",
        "up": "米达斯"
    },
    "42": {
        "type": "2",
        "name": "怯者的墓志铭",
        "up": "怯者的墓志铭"
    },
    "43": {
        "type": "1",
        "name": "振玉知微",
        "up": "珑"
    },
    "44": {
        "type": "2",
        "name": "千灯无间",
        "up": "千灯无间"
    },
    "45": {
        "type": "1",
        "name": "渊火伏明",
        "up": "林"
    },
    "46": {
        "type": "2",
        "name": "野风",
        "up": "野风"
    },
    "47": {
        "type": "1",
        "name": "日暮寻路",
        "up": "北洛"
    },
    "48": {
        "type": "1",
        "name": "灼金格言",
        "up": "玄戈"
    },
    "49": {
        "type": "2",
        "name": "「默」",
        "up": "「默」"
    },
    "50": {
        "type": "1",
        "name": "空心人",
        "up": "余音"
    },
    "51": {
        "type": "2",
        "name": "神·迹",
        "up": "神·迹"
    },
    "52": {
        "type": "1",
        "name": "至暗至明",
        "up": "十手卫"
    },
    "53": {
        "type": "2",
        "name": "须臾浮生",
        "up": "须臾浮生"
    },
    "54": {
        "type": "1",
        "name": "潮生流火",
        "up": "龙和"
    },
    "55": {
        "type": "2",
        "name": "泅游",
        "up": "泅游"
    },
    "56": {
        "type": "1",
        "name": "瑞金游方",
        "up": "温留"
    },
    "57": {
        "type": "2",
        "name": "新醅",
        "up": "新醅"
    },
    "58": {
        "type": "1",
        "name": "柙中独白",
        "up": "茜茜"
    },
    "59": {
        "type": "2",
        "name": "欢声萦回",
        "up": "欢声萦回"
    },
    "60": {
        "type": "1",
        "name": "二分的狂徒",
        "up": "拉波"
    },
    "61": {
        "type": "2",
        "name": "形与神",
        "up": "形与神"
    },
    "62": {
        "type": "1",
        "name": "是，主厨！",
        "up": "谛卡"
    },
    "63": {
        "type": "2",
        "name": "沙中金火",
        "up": "沙中金火"
    },
    "64": {
        "type": "1",
        "name": "第三种诘问",
        "up": "司旸"
    },
    "65": {
        "type": "2",
        "name": "失罪夜",
        "up": "失罪夜"
    },
    "66": {
        "type": "1",
        "name": "云端来信·二",
        "up": "言雀"
    },
    "67": {
        "type": "2",
        "name": "堕入星尘",
        "up": "堕入星尘"
    },
    "68": {
        "type": "1",
        "name": "裁梦刀",
        "up": "织雪"
    },
    "69": {
        "type": "2",
        "name": "局外人",
        "up": "局外人"
    },
    "70": {
        "type": "1",
        "name": "岁暮重明·二",
        "up": "百里屠苏"
    },
    "71": {
        "type": "2",
        "name": "洗出汪外",
        "up": "洗出汪外"
    },
    "72": {
        "type": "1",
        "name": "虚构叙实",
        "up": "逸虚"
    },
    "73": {
        "type": "2",
        "name": "记虚",
        "up": "记虚"
    },
    "74": {
        "type": "1",
        "name": "飞雪初晴·二",
        "up": "风晴雪"
    },
    "75": {
        "type": "2",
        "name": "全息邂逅",
        "up": "全息邂逅"
    },
    "76": {
        "type": "1",
        "name": "绿野聆风",
        "up": "紫都"
    },
    "77": {
        "type": "2",
        "name": "光风之下",
        "up": "光风之下"
    },
    "78": {
        "type": "1",
        "name": "血色丝序",
        "up": "红珠小姐"
    },
    "79": {
        "type": "2",
        "name": "为伍",
        "up": "为伍"
    },
    "80": {
        "type": "1",
        "name": "荒土悲歌·二",
        "up": "米达斯"
    },
    "81": {
        "type": "2",
        "name": "明日暄风",
        "up": "明日暄风"
    },
    "5001": {
        "type": "1",
        "name": "识海甄录",//自选卡池
        "up": "",
        "limit": [
            {
                "name": "识海甄录·消夏归航(自选卡池)",
                "up": "",
                "startTime": "2025-05-01 04:00:00",
                "endTime": "2025-07-24 03:50:00"
            },
            {
                "name": "识海甄录·二(自选卡池)",
                "up": "",
                "startTime": "2025-07-31 04:00:00",
                "endTime": "2025-09-11 03:50:00"
            }
        ]
    },
    "10001": {
        "type": "1",
        "name": "既定回响·一",
        "up": ""
    },
    "10002": {
        "type": "1",
        "name": "既定回响·二",
        "up": ""
    },
    "10003": {
        "type": "1",
        "name": "既定回响·三",
        "up": ""
    },
    "10004": {
        "type": "1",
        "name": "既定回响·四",
        "up": ""
    },
    "10005": {
        "type": "1",
        "name": "既定回响·五",
        "up": ""
    },
    "10006": {
        "type": "1",
        "name": "既定回响·六",
        "up": ""
    },
    "10007": {
        "type": "1",
        "name": "既定回响·七",
        "up": ""
    },
    "10008": {
        "type": "1",
        "name": "既定回响·八",
        "up": ""
    },
    "10009": {
        "type": "1",
        "name": "既定回响·九",
        "up": ""
    },
    "10010": {
        "type": "1",
        "name": "既定回响·十",
        "up": ""
    },
    "10011": {
        "type": "1",
        "name": "既定回响·十一",
        "up": ""
    },
    "10012": {
        "type": "1",
        "name": "既定回响·十二",
        "up": ""
    },
    "10013": {
        "type": "1",
        "name": "既定回响·十三",
        "up": ""
    },
    "10014": {
        "type": "1",
        "name": "既定回响·十四",
        "up": ""
    },
    "10015": {
        "type": "1",
        "name": "既定回响·十五",
        "up": ""
    },
    "10016": {
        "type": "1",
        "name": "既定回响·十六",
        "up": ""
    },
    "10017": {
        "type": "1",
        "name": "既定回响·十七",
        "up": ""
    },
}