import { SkillColorEnum } from '../enum/skillSimpleEnum.ts';
import { ToastSkillEnum } from '../enum/toastSkillEnum.ts';
import { MXLaohenEnum } from '../enum/laohenNameEnum.ts';
import { speSkillCon } from '../consts/SkillCon.ts';

const Desc = {
    "job": "轻卫", "skill": [MXLaohenEnum.一线生机, MXLaohenEnum.卸劲化能], "attr": "lei", "star": "6",
    "nameEn": "KYLIN", "tag": ["防护", "输出", "屏障"], "originWorld": "森罗", "orginChar": "古剑奇谭二",
    "cv": "赵毅", "openDate": "2024年04月18日", "resourse": ["常态共鸣·森罗万象", "定向共鸣·王牌机械师"]
}

const Skill = [
    {
        "name": "电蛛Ⅰ代",
        "aliasNum": "1",//技能简称，1技能
        "maxLevel": 15,//技能最大等级
        "detail": {
            "type": "主动技能",//技能类型，主动、被动、自定等
            "skillTab": [["指令冷却", "15秒"], ["次数", "4"]],//技能使用情况，如冷却，可使用次数
            "tab": ["伤害", "负面状态", "对空", "穿透屏障"],//技能标签
            "sizeLevel": [
                ["750%"],
                ["863%"],
                ["975%"],
                ["1088%"],
                ["1200%"],
                ["1313%"],
                ["1425%"],
                ["1538%"],
                ["1650%"],
                ["1725%"],
                ["1800%"],
                ["1875%"],
                ["1950%"],
                ["2025%"],
                ["2100%"]
            ],
            "content": [
                speSkillCon("技能施放后进入【防御姿态】", SkillColorEnum.injuries),
                "",
                "向目标位置投射两枚电网导弹，每枚对半径",
                speSkillCon("250"),
                "范围内的敌人造成",
                speSkillCon("", 0, -1, 0),
                speSkillCon("最终攻击的雷元素伤害"),
                "，随后以",
                speSkillCon("3级[位移强度]", SkillColorEnum.normal, ToastSkillEnum.位移强度),
                "将其拉到身边，使其优先攻击自己，并回复自身全部格挡值"
            ]//满级技能内容描述
        }
    },
    {
        "name": "霹雳网",
        "aliasNum": "2",
        "maxLevel": 15,
        "detail": {
            "type": "主动技能",
            "skillTab": [["施放冷却", "20秒"], ["次数", "3"]],
            "tab": ["伤害", "自身增益", "负面状态"],
            "sizeLevel": [
                ["1000%", "80%"],
                ["1150%", "92%"],
                ["1300%", "104%"],
                ["1450%", "116%"],
                ["1600%", "128%"],
                ["1750%", "140%"],
                ["1900%", "152%"],
                ["2050%", "164%"],
                ["2200%", "176%"],
                ["2300%", "184%"],
                ["2400%", "192%"],
                ["2500%", "200%"],
                ["2600%", "208%"],
                ["2700%", "216%"],
                ["2800%", "224%"]
            ],
            "content": [
                "被动:",
                speSkillCon("【防御姿态】", SkillColorEnum.injuries),
                "下每隔",
                speSkillCon("15"),
                "秒，随机弹开一个武装机械臂发动一轮攻击，造成",
                speSkillCon("", 0, -1, 0),
                speSkillCon("最终攻击的雷元素伤害"),
                "",
                "主动：",
                speSkillCon("进入【防御姿态】", SkillColorEnum.injuries),
                "，拉起电网强化机甲，回复自身全部格挡值，在目标位置留下一张电网，并生成另一张电网跟随自身移动。每张电网每隔",
                speSkillCon("2"),
                "秒对范围内的目标造成",
                speSkillCon("", 0, -1, 1),
                speSkillCon("最终攻击的雷元素伤害"),
                "并使目标受到持续",
                speSkillCon("1"),
                "秒的",
                speSkillCon("[眩晕]", SkillColorEnum.normal, ToastSkillEnum.眩晕),
                "效果，电网持续存在",
                speSkillCon("20"),
                "秒"
            ]
        }
    },
    {
        "name": "扳仔出击！",
        "aliasNum": "异核",
        "maxLevel": 6,
        "detail": {
            "type": "异核技能",
            "skillTab": [["充能时间", "100秒"]],
            "tab": ["伤害", "自身增益", "拦截", "对空", "格挡条破坏1"],
            "sizeLevel": [
                ["3000%", "1800%", "150%", "1200%", "180%", "300%", "300%", "180%"],
                ["3500%", "2100%", "175%", "1400%", "210%", "350%", "350%", "210%"],
                ["4000%", "2400%", "200%", "1600%", "240%", "400%", "400%", "240%"],
                ["4500%", "2700%", "225%", "1800%", "270%", "450%", "450%", "270%"],
                ["4750%", "2850%", "237%", "1900%", "285%", "475%", "475%", "285%"],
                ["5000%", "3000%", "250%", "2000%", "300%", "500%", "500%", "300%"]
            ],
            "content": [
                speSkillCon("进入【攻击姿态】", SkillColorEnum.injuries),
                "，展开所有机械臂火力全开，使用各类枪械对全场随机目标进行扫射，造成",
                speSkillCon("", 0, -1, 0),
                speSkillCon("最终攻击的雷元素伤害"),
                "和",
                speSkillCon("", 0, -1, 1),
                speSkillCon("最终攻击的物理伤害"),
                "",
                speSkillCon("【攻击姿态】", SkillColorEnum.injuries),
                "期间失去格挡能力，每次攻击破坏敌方",
                speSkillCon("1段格挡条"),
                "，并持续用各类枪械攻击敌方目标:",
                "",
                "「破天轰雷」每10秒攻击一次，期间持续对自身半径",
                speSkillCon("1500"),
                "范围内的随机目标放射电流，共造成",
                speSkillCon("", 0, -1, 2),
                speSkillCon("最终攻击的雷元素伤害"),
                ";蓄力后，对正前方宽度",
                speSkillCon("450"),
                "范围发射超远电磁炮，对路径上敌人造成",
                speSkillCon("", 0, -1, 3),
                speSkillCon("最终攻击的雷元素伤害"),
                "，并摧毁敌方投射物",
                "",
                "「无敌光波」每5秒攻击一次，对目标发射激光，对半径",
                speSkillCon("100"),
                "范围的敌人造成",
                speSkillCon("", 0, -1, 4),
                speSkillCon("最终攻击的物理伤害"),
                "",
                "「连环飞弹」每5秒攻击一次，对地面区域投射导弹，每次两枚，共对半径",
                speSkillCon("250"),
                "范围的敌人造成",
                speSkillCon("", 0, -1, 5),
                speSkillCon("最终攻击的雷元素伤害"),
                "",
                "「扳扳主炮」强化普通攻击，每次对目标造成",
                speSkillCon("", 0, -1, 6),
                speSkillCon("最终攻击的雷元素伤害"),
                "",
                "「扳扳副炮」每3秒攻击一次，持续向目标发射子弹，共对目标造成",
                speSkillCon("", 0, -1, 7),
                speSkillCon("最终攻击的雷元素伤害"),
                "",
                speSkillCon("【攻击姿态】", SkillColorEnum.injuries),
                "下可施放技能【解除出击】:回到",
                speSkillCon("【防御姿态】", SkillColorEnum.injuries),
                ":进行机甲维修，产生6次生命回复效果，每次回复自身",
                speSkillCon("6%最大生命值"),
                "",
                "退出",
                speSkillCon("【攻击姿态】", SkillColorEnum.injuries),
                "时:根据异核剩余充能时间的",
                speSkillCon("25%"),
                "返还异核充能"
            ]
        }
    },
    {
        "name": "特性：仁兽止戈",
        "aliasNum": "特性",//特性技能需要特殊处理，在具体的地方需要用v-if判断
        "detail": {
            "type": "战斗特性",
            "tab": [["射程", "500"], ["攻击速度", "0.40次每秒"]],
            "atType": ["单体", "对空"],
            "content": [
                "向当前目标发射子弹造成",
                speSkillCon("250%最终攻击的雷元素伤害")
            ],//普通攻击
            "specialContent": [
                [
                    "通过主动技能进入",
                    speSkillCon("【防御姿态】", SkillColorEnum.injuries),
                    "(初始为",
                    speSkillCon("【防御姿态】", SkillColorEnum.injuries),
                    "，通过异核技能进入",
                    speSkillCon("【攻击姿态】", SkillColorEnum.injuries),
                    "",
                    speSkillCon("【攻击姿态】", SkillColorEnum.injuries),
                    "下，自身增加刻印终端",
                    speSkillCon("30%"),
                    speSkillCon("（属性乘区·刻印攻击额外增加值）", SkillColorEnum.injuries),
                    "的刻印攻击额外增加值，超过1000部分的刻印终端值，增加的刻印攻击翻倍",
                    "",
                    "登场异核充能增加70%",
                    "",
                    "屏障:登场后，机甲面前会生成三片持续",
                    speSkillCon("15"),
                    "秒的",
                    speSkillCon("较大强度"),
                    "的屏障，屏障持续时间结束或被打破后，等待",
                    speSkillCon("30"),
                    "秒将自动修复，若期间生成屏障，将重新开始自动修复的计时。",
                    "",
                    "使用技能【电蛛I代】、【霹雳网】、【扳扳出击!】时，可立即修复自身所有屏障，并在机甲背后生成三片新屏障（背后的三片屏障被打破后不会自动修复），屏障持续",
                    speSkillCon("15"),
                    "秒"
                ],//零花本体特性
                [
                    "主动技能【霹雳网】可使用次数+1，电网每次电击时都会以",
                    speSkillCon("2级[位移强度]", SkillColorEnum.normal, ToastSkillEnum.位移强度),
                    "将敌人向中心牵引"
                ],//一花特性
                [
                    "【攻击姿态】下，自身增加刻印终端",
                    speSkillCon("60%"),
                    speSkillCon("（属性乘区·刻印攻击额外增加值）", SkillColorEnum.injuries),
                    "的刻印攻击额外增加值，超过1000部分的刻印终端值，增加的刻印攻击翻倍（覆盖初始特性）"
                ]//三花特性
            ]
        }
    }
]

const Tea = {
    "achievement": [
        {
            "name": "严禁酒驾",
            "limit": "【默契值13级】",
            "tips": [
                "“监督，我要是喝了这杯沉金记忆，等下还能开扳不倒三号吗？”",
                "“绝·对·不·行。”"
            ],
            "recipe": [
                "柯林杯",
                "沉金记忆",
                "无糖",
                "柠檬汁",
                "经典长签"
            ]
        },
        {
            "name": "家风如此",
            "limit": "【默契值5级】",
            "tips": [
                "“我已经把你那份咖啡换成低因的了，还是喝不惯吗？”",
                "“没办法，我妈从小就不让我碰这些——而且低因也好苦啊！”",
                "“……那我再给你加勺草莓冰淇淋。”"
            ],
            "recipe": [
                "家用玻璃杯",
                "经典特浓咖啡",
                "糖浆",
                "低因",
                "草莓冰淇淋",
                "桂花"
            ]
        },
        {
            "name": "朋友的意义",
            "limit": "【默契值13级】",
            "tips": [
                "“监督监督，我要阿华田奶茶，五分糖，加珍珠。我记得没有加冰的选项？真可惜。”",
                "“你这点单也太熟练了吧……不是说傅女士平常不让你喝这些的吗？”",
                "“咳，如果我说是风清洛教我的，监督你信吗？”",
                "“如果这不是我这个月第三次听你甩锅给他，我可能会信。”",
                "“那……雪长夏教我的？花时也行。”"
            ],
            "recipe": [
                "柯林杯",
                "阿华田奶茶",
                "五分糖",
                "珍珠",
                "樱花"
            ]
        },
        {
            "name": "共通之处？",
            "limit": "【默契值8级】",
            "tips": [
                "“我怀疑你们这些研究机械的人是不是都拿味觉换了天赋啊……”",
                "“怎么这么说？”",
                "“瞳老师、禺期前辈还有你，居然都是姜茶爱好者。”",
                "“很好喝啊~”"
            ],
            "recipe": [
                "环口杯",
                "姜茶",
                "正常糖",
                "少冰",
                "迷迭香"
            ]
        },
        {
            "name": "办法总比困难多",
            "limit": "【默契值1级】",
            "tips": [
                "“双莓之恋……BS的联名款？”",
                "“你知道？”",
                "“当然啦。我不是跟监督你说过，我很关注那个艾达来的仿生机器人的。监督，我真的不能邀请她扫描——”",
                "“不能。”",
                "“那我退一步。如果说我非常有礼貌地——”",
                "“不行。”",
                "“但是我好不容易才抽到她的见面签售券，聊两句总归可以吧——”",
                "“……啊？”"
            ],
            "recipe": [
                "环口杯",
                "双莓之恋",
                "七分糖",
                "正常冰",
                "薄荷叶"
            ]
        },
        {
            "name": "头痛忽然来",
            "limit": "【默契值1级】",
            "tips": [
                "“乐无异你这杯苏打水里有95%是冰块吧？喝太快会头疼的，你小心——”",
                "“喵了个咪！好痛！”",
                "“——我都还没说完。”"
            ],
            "recipe": [
                "家用玻璃杯",
                "冰镇苏打水",
                "多冰",
                "茶冻",
                "心形插签"
            ]
        },
        {
            "name": "风花雪月",
            "limit": "【默契值16级】",
            "tips": [
                "“怎么来这里还在捣鼓通讯器？最喜欢的雪梨汁不喝了？”",
                "“嗯，等会吧。风清洛今天晚上的飞机，我急着把这个改装完给他送去。”",
                "“改装？”",
                "“不是什么危险的事，就是加装了个独立发信器。这样……那家伙不管到哪里、不管什么时候，只要打开通讯器，都能联系到我们。”",
                "“我们……？”",
                "“风花雪月。”",
                "说出这四个字，乐无异好像有些不好意思。",
                "但他的眼睛是那么亮。"
            ],
            "recipe": [
                "双层叶纹",
                "鲜榨雪梨汁",
                "多冰",
                "椰果",
                "三叶长签"
            ]
        }
    ],
    "hignRapport": [
        {
            "needLevel": 1,
            "recipe": [
                "冰镇苏打水",
                "多冰",
                "咸梅干"
            ],
            "ex": [495, 554, 604, 659],//参考默契值，无加，满家具，满加成
        },
        {
            "needLevel": 10,
            "recipe": [
                "玻璃橘子",
                "多冰",
                "叶子冻"
            ],
            "ex": [540, 604, 659, 719],//参考默契值，无加，满家具，满加成
        },
        {
            "needLevel": 18,
            "recipe": [
                "杨枝甘露",
                "原味雪顶",
                "珍珠"
            ],
            "ex": [567, 635, 692, 755],//参考默契值，无加，满家具，满加成
        }
    ]
}

const 乐无异 = {
    "desc": Desc,
    "skill": Skill,
    "tea": Tea
}

export { 乐无异 }