import { SkillColorEnum } from '../enum/skillSimpleEnum.ts';
import { ToastSkillEnum } from '../enum/toastSkillEnum.ts';
import { MXLaohenEnum } from '../enum/laohenNameEnum.ts';
import { speSkillCon } from '../consts/SkillCon.ts';

const Desc = {
    "job": "游徒", "skill": [MXLaohenEnum.庇佑, MXLaohenEnum.束缚蚀力], "attr": "shi", "star": "5",
    "nameEn": "VIDAR", "tag": ["输出", "召唤"], "originWorld": "特默里恩", "orginChar": "古剑奇谭网络版",
    "cv": "刘十四", "openDate": "2024年01月18日", "resourse": ["定向共鸣·游光澄明", "常态共鸣"]
}

const Skill = [
    {
        "name": "凋亡舞步",
        "aliasNum": "1",//技能简称，1技能
        "maxLevel": 12,//技能最大等级
        "detail": {
            "type": "主动技能",//技能类型，主动、被动、自定等
            "skillTab": [["指令冷却", "20秒"], ["次数", "3"]],//技能使用情况，如冷却，可使用次数
            "tab": ["伤害", "持续施法"],//技能标签
            "content": [
                "操控傀儡在目标位置起舞攻击周围敌人，8秒内对半径",
                speSkillCon("250"),
                "范围内的敌人每次造成",
                speSkillCon("125%最终攻击的蚀元素伤害"),
                "，共造成25次伤害，并为终端附加",
                speSkillCon("25点蚀爆值"),
                "，每",
                speSkillCon("10%"),
                "攻击速度提升可额外增加一次伤害",
                "",
                "【连击】︰重新选择傀儡的起舞位置，并额外对目标位置半径",
                speSkillCon("300"),
                "范围内的敌人造成",
                speSkillCon("500%最终攻击的蚀元素伤害")
            ]//满级技能内容描述
        }
    },
    {
        "name": "维达尔契约",
        "aliasNum": "2",
        "maxLevel": 12,
        "detail": {
            "type": "主动技能",
            "skillTab": [["指令冷却", "20秒"], ["次数", "3"]],
            "tab": ["伤害", "自身增益", "负面状态"],
            "content": [
                "【被动】：当友方同调者受到攻击时，傀儡会",
                speSkillCon("[定身]", SkillColorEnum.normal, ToastSkillEnum.定身),
                "友方半径",
                speSkillCon("300"),
                "范围内的敌人",
                speSkillCon("2"),
                "秒，并造成",
                speSkillCon("1000%最终攻击的蚀元素伤害"),
                "，冷却时间",
                speSkillCon("10"),
                "秒",
                "",
                "【主动】：指挥傀儡对指定位置半径",
                speSkillCon("300"),
                "范围内的敌人造成",
                speSkillCon("1000%最终攻击的蚀元素伤害"),
                "和被动的",
                speSkillCon("[定身]", SkillColorEnum.normal, ToastSkillEnum.定身),
                "效果，同时提高自身",
                speSkillCon("50%"),
                speSkillCon("（属性乘区·攻击力加成）", SkillColorEnum.injuries),
                "攻击力，持续",
                speSkillCon("20"),
                "秒；强化效果期间，傀儡每次普通攻击为终端附加",
                speSkillCon("2点蚀爆值")
            ]
        }
    },
    {
        "name": "羽化世代",
        "aliasNum": "异核",
        "maxLevel": 6,
        "detail": {
            "type": "异核技能",
            "skillTab": [["充能时间", "80秒"]],
            "tab": ["自身增益"],
            "content": [
                "回复全部生命和技能使用次数，前3次施放依次激活强化效果：",
                "",
                "【I】普通攻击的攻击速度提升",
                speSkillCon("30%"),
                speSkillCon("（属性乘区·攻击速度）", SkillColorEnum.injuries),
                "，额外造成",
                speSkillCon("180%最终攻击的蚀元素伤害"),
                "，并额外为终端附加",
                speSkillCon("1点蚀爆值"),
                "",
                "【II】主动技能【凋亡舞步】不再需要持续施法，额外为终端增加",
                speSkillCon("5点蚀爆值"),
                "",
                "【III】主动技能【维达尔契约】持续期间傀儡攻击会",
                speSkillCon("[定身]", SkillColorEnum.normal, ToastSkillEnum.定身),
                "目标",
                speSkillCon("2"),
                "秒",
                "",
                "初次施放所需充能时间减少",
                speSkillCon("35"),
                "秒",
            ]
        }
    },
    {
        "name": "特性：天命作茧",
        "aliasNum": "特性",//特性技能需要特殊处理，在具体的地方需要用v-if判断
        "detail": {
            "type": "战斗特性",
            "tab": [["射程", "800"], ["攻击速度", "0.40次每秒"]],
            "atType": ["单体", "对空"],
            "content": [
                "操控傀儡攻击目标造成",
                speSkillCon("220%最终攻击的蚀元素伤害"),
                "，普通攻击为终端附加",
                speSkillCon("4点蚀爆值"),
            ],//普通攻击
            "specialContent": [
                [
                    "傀儡视为召唤物",
                    "",
                    "终端每有1点蚀爆值，凤无梦造成的伤害额外提高",
                    speSkillCon("0.2%"),
                    speSkillCon("（增伤乘区·额外伤害）", SkillColorEnum.injuries),
                    "，最多不超过",
                    speSkillCon("30%")
                ],//零花本体特性
                [
                    "主动技能【凋亡舞步】触发连击时，不会停止上一个技能位置的傀儡起舞"
                ],//一花特性
                [
                    "终端每有1点蚀暴值，凤无梦对其造成的伤害提高",
                    speSkillCon("0.5%"),
                    speSkillCon("（增伤乘区·额外伤害）", SkillColorEnum.injuries),
                    "，最多不超过",
                    speSkillCon("30%")
                ]//三花特性
            ]
        }
    }
]

const Tea = {
    "achievement": [
        {
            "name": "森罗特有套路",
            "limit": "【默契值1级】",
            "tips": [
                "“‘正常糖、热、蜜桃冻’，看着和公式也差不多嘛。”",
                "“监督监督，难道‘联名’是什么森罗特有的回路吗？只要说出口，就能召集那么多人排队——”",
                "“比起回路，不如说是森罗特有套路。”监督一脸平静。"
            ],
            "recipe": [
                "淑女风尚",
                "双莓之恋",
                "正常糖",
                "热",
                "蜜桃冻",
                "白玉兰"
            ]
        },
        {
            "name": "误会一场",
            "limit": "【默契值1级】",
            "tips": [
                "“啊呀，监督你讨厌无梦小姐可以直说的！”",
                "“你别乱说，我没有。”",
                "“那你为什么要往无梦小姐的枸杞菊花茶里放梅干？咸得都喝不出黄瓜片的清香了！桂花味也闻不到了！”",
                "“啊，我手抖放错了！”"
            ],
            "recipe": [
                "经典格纹",
                "枸杞菊花茶",
                "黄瓜片",
                "咸梅干",
                "桂花"
            ]
        },
        {
            "name": "网络一线牵",
            "limit": "【默契值1级】",
            "tips": [
                "“凤无梦，难得你主动说想尝尝苏打水，我还以为你很喜欢？可是看你的表情……”",
                "“无梦小姐被骗了啦监督！网上那些家伙说，加了薄荷叶和茶冻的苏打水天下第一！我看是天下第一难喝才对！”",
                "“噗，原来是这样如此……”"
            ],
            "recipe": [
                "青叶陶瓷杯",
                "冰镇苏打水",
                "多冰",
                "茶冻",
                "薄荷叶"
            ]
        },
        {
            "name": "疯狂森罗人",
            "limit": "【默契值1级】",
            "tips": [
                "“为了名字硬凑新品？完全不考虑味道吗？”人偶端着好椰拿铁，十分困惑地歪着头，“那岂不是很容易搞出一些很暗黑的饮料？”",
                "“的确如此。可是有时候，越是难喝，越会受到追捧。”",
                "“……我刚刚还在想，我要是多加一份糖包和浓缩咖啡会不会太疯狂……看来远不如你们森罗人哩！”"
            ],
            "recipe": [
                "淑女风尚",
                "好椰拿铁",
                "糖包",
                "加一份",
                "三叶长签"
            ]
        },
        {
            "name": "漂亮装饰",
            "limit": "【默契值5级】",
            "tips": [
                "“本来是为了鹿头装饰才点的冻柠茶，没想到银杏叶也那么漂亮啊！宝宝都想要！宝宝都想要！”",
                "“给你给你。”"
            ],
            "recipe": [
                "经典格纹",
                "鹿鹿冻柠茶",
                "七分糖",
                "少冰",
                "银杏叶"
            ]
        },
        {
            "name": "强大记忆力",
            "limit": "【默契值8级】",
            "tips": [
                "“监督，你怎么知道无梦小姐喜欢喝这个？”",
                "“她之前点过，不是吗？”",
                "“可是她只点过一次，还是和大家一起点的！这样都能记住吗？”",
                "“嗯。”监督不假思索地“吟唱”了起来，“熊熊燕麦牛奶，但是换成脱脂版本，加一份汪汪饼干，还有水果签……对吗？”",
                "“……全对。那个……谢谢您。”",
            ],
            "recipe": [
                "淑女风尚",
                "熊熊燕麦牛奶",
                "脱脂牛奶",
                "汪汪饼干",
                "水果签"
            ]
        },
        {
            "name": "你脸红啦",
            "limit": "【默契值16级】",
            "tips": [
                "“没想到在特默里恩之外，还有这么多异世界！要是能去看看就好了！”",
                "“一定能去的。”监督将纸伞插在鎏金杯口的动作行云流水，可语气却变得有些微妙的紧绷，“……我保证。”",
                "“嗯，我相信您。”凤无梦难得开口道。",
                "…………",
                "“哎呀！监督你脸红啦！羞羞！”"
            ],
            "recipe": [
                "鎏·金",
                "德里亚德风味花茶",
                "热",
                "蜜桃冻",
                "精致纸伞"
            ]
        }
    ],
    "hignRapport": [
        {
            "needLevel": 1,
            "recipe": [
                "好椰拿铁",
                "椰浆",
                "低因"
            ],
            "ex": [393, 441, 480],//参考默契值，无加，满家具，满加成
        },
        {
            "needLevel": 6,
            "recipe": [
                "柚柚切颗NOW",
                "五分糖",
                "奇异果片"
            ],
            "ex": [512, 573, 625],//参考默契值，无加，满家具，满加成
        }
    ]
}

const 凤无梦 = {
    "desc": Desc,
    "skill": Skill,
    "tea": Tea
}

export { 凤无梦 }