import { SkillColorEnum } from '../enum/skillSimpleEnum.ts';
import { MXLaohenEnum } from '../enum/laohenNameEnum.ts';
import { speSkillCon } from '../consts/SkillCon.ts';

const Desc = {
    "job": "游徒", "skill": [MXLaohenEnum.人形特攻α型, MXLaohenEnum.灵感激活], "attr": "shi", "star": "5",
    "nameEn": "GINA", "tag": ["输出", "爆发"], "originWorld": "特默里恩", "orginChar": "原创",
    "cv": "降温", "openDate": "2024年01月12日", "resourse": ["常态共鸣"]
}

const Skill = [
    {
        "name": "毒刃",
        "aliasNum": "1",//技能简称，1技能
        "maxLevel": 12,//技能最大等级
        "detail": {
            "type": "主动技能",//技能类型，主动、被动、自定等
            "skillTab": [["指令冷却", "20秒"], ["次数", "5"]],//技能使用情况，如冷却，可使用次数
            "tab": ["伤害", "穿透屏障"],//技能标签
            "content": [
                "朝指定方向投掷剧毒匕首，匕首会命中范围内的所有敌方单位，对每个目标造成",
                speSkillCon("2000%最终攻击的蚀元素伤害"),
                "，并为终端附加",
                speSkillCon("20点蚀爆值"),
                "",
                "同时自身在技能释放后",
                speSkillCon("20"),
                "秒内普通攻击命中后，匕首必定会穿透路径上的所有敌方单位",
                "",
                "【连击】：技能额外效果的持续时间延长",
                speSkillCon("10"),
                "秒，且普通攻击匕首造成的伤害提高",
                speSkillCon("100%"),
                speSkillCon("（增伤乘区·独立增伤）", SkillColorEnum.injuries)
            ]//满级技能内容描述
        }
    },
    {
        "name": "封喉",
        "aliasNum": "2",
        "maxLevel": 12,
        "detail": {
            "type": "自动技能",
            "skillTab": [["施放冷却", "10秒"]],
            "tab": ["伤害"],
            "content": [
                "立即闪现至目标身后，对其造成",
                speSkillCon("2000%最终攻击的蚀元素伤害"),
                "，并为终端附加",
                speSkillCon("5点蚀爆值"),
                "",
                "伤害目标当前生命值低于",
                speSkillCon("40%"),
                speSkillCon("（属性乘区·忽略减伤）", SkillColorEnum.injuries),
                "时，忽略目标",
                speSkillCon("10%"),
                "基础减伤",
                "",
                "目标每受到过一次蚀爆伤害，该技能对其造成的伤害额外提高",
                speSkillCon("20%"),
                speSkillCon("（增伤乘区·额外伤害）", SkillColorEnum.injuries),
                "，最多提高",
                speSkillCon("100%"),
                speSkillCon("（增伤乘区·额外伤害）", SkillColorEnum.injuries)
            ]
        }
    },
    {
        "name": "附骨",
        "aliasNum": "异核",
        "maxLevel": 6,
        "detail": {
            "type": "异核技能",
            "skillTab": [["充能时间", "60秒"]],
            "tab": ["伤害", "自身增益"],
            "content": [
                "冲向目标位置，向四周散射大量剧毒匕首，对其中的所有单位造成",
                speSkillCon("3300%最终攻击的蚀元素伤害"),
                "，为终端附加",
                speSkillCon("20点蚀爆值"),
                "",
                "并在",
                speSkillCon("25"),
                "秒内，【封喉】释放后返还",
                speSkillCon("50%"),
                "的冷却时间",
                "",
                "伤害造成暴击时，该效果的持续时间延长至",
                speSkillCon("40"),
                "秒"
            ]
        }
    },
    {
        "name": "特性：剧毒之牙",
        "aliasNum": "特性",//特性技能需要特殊处理，在具体的地方需要用v-if判断
        "detail": {
            "type": "战斗特性",
            "tab": [["射程", "800"], ["攻击速度", "0.56次每秒"]],
            "atType": ["单体", "对空"],
            "content": [
                "为2连击，向当前目标连续发射两枚剧毒匕首造成",
                speSkillCon("180%最终攻击的蚀元素伤害"),
                "并为终端附加",
                speSkillCon("3点蚀爆值"),
                "；命中首个目标造成暴击后，匕首会穿透路径上的所有敌方单位"
            ],//普通攻击
            "specialContent": [
                [
                    "无"
                ],//零花本体特性
                [
                    "参与击杀后返还",
                    speSkillCon("40%"),
                    "自动技能【封喉】的冷却时间"
                ],//一花特性
                [
                    "自身暴击率提升",
                    speSkillCon("20%"),
                    speSkillCon("（属性乘区·暴击率）", SkillColorEnum.injuries),
                    "，暴击伤害提升",
                    speSkillCon("20%"),
                    speSkillCon("（属性乘区·暴击伤害）", SkillColorEnum.injuries)
                ]//三花特性
            ]
        }
    }
]

const Tea = {
    "achievement": [
        {
            "name": "警铃大作",
            "limit": "【默契值1级】",
            "tips": [
                "隐藏在白桃香气之下的苦涩滋味，令吉娜不由得弓起脊背。",
                "“只是加了些热茶和菊花而已，别紧张。”"
            ],
            "recipe": [
                "自证方圆",
                "桃桃乌龙茶",
                "正常糖",
                "热",
                "菊花"
            ]
        },
        {
            "name": "抗拒温暖",
            "limit": "【默契值1级】",
            "tips": [
                "吉娜的视线快速扫过吧台。",
                "枸杞、菊花、杨桃、银杏叶……",
                "她不喜欢这些让她心头一暖的东西。"
            ],
            "recipe": [
                "竹节茶杯",
                "枸杞菊花茶",
                "杨桃",
                "叶子冻",
                "银杏叶"
            ]
        },
        {
            "name": "无效伪装",
            "limit": "【默契值1级】",
            "tips": [
                "即便加了那么多冰块，一股独属于蜂蜜啤酒的古怪香气冲击着吉娜的鼻腔，她反倒挤出一丝笑容。",
                "监督有些无奈地长叹了口气：“在我面前，你可以不伪装的。”",
                "……嘶。"
            ],
            "recipe": [
                "简约至上",
                "蜂蜜啤酒",
                "多冰",
                "偏烈",
                "经典长签"
            ]
        },
        {
            "name": "口是心非",
            "limit": "【默契值6级】",
            "tips": [
                "“苏打水而已。”吉娜如此评价道。",
                "但监督望着她被冰到泛红还不肯放开竹节茶杯的手指，微微笑了。",
                "“嘶，你盯着看什么。”",
                "“咳，没什么，就是觉得白玉兰不错，咳咳。”"
            ],
            "recipe": [
                "竹节茶杯",
                "冰镇苏打水",
                "正常冰",
                "芒果果冻",
                "白玉兰"
            ]
        },
        {
            "name": "狩猎时刻",
            "limit": "【默契值5级】",
            "tips": [
                "看着杯口如星光般的碎盐，吉娜忽然想起了特默里恩的夜空。",
                "还有那些在她手中颤动的喉管、不断涌出的……",
                "“难得看你发呆，是‘黑月亮’不合口吗？”",
                "“不……只是突然想起了一些不那么难捱的日子。”",
                "她伸出舌头，隐秘地舔了舔嘴边鲜红的樱桃汁水。"
            ],
            "recipe": [
                "简约至上",
                "黑月亮",
                "少冰",
                "盐",
                "樱桃",
                "精致纸伞"
            ]
        },
        {
            "name": "是小狗吗",
            "limit": "【默契值13级】",
            "tips": [
                "刚把黎威尔日升端了出来，某人的尾巴就开始小幅度地摇晃了起来。",
                "当监督转过身，在熊熊杯上细致地绑蝴蝶结时，身后更是传来一阵细微的破空声。",
                "究竟有多喜欢，才能把尾巴摇出这个声音啊。",
                "监督偷偷朝身后看了一眼，某人似乎完全没意识到呢。"
            ],
            "recipe": [
                "熊熊杯",
                "黎威尔日升",
                "奶精球",
                "柠檬汁",
                "青梅",
                "蝴蝶结"
            ]
        },
        {
            "name": "眼下为真",
            "limit": "【默契值16级】",
            "tips": [
                "“你就不怕，有一天我会了结你的生命——就像真正的怪物那样。”",
                "“这件事……还是等真正发生了，再由未来的我去考虑吧。”监督歪了歪头，“现在我更在意我眼前名叫吉娜的女士会不会觉得这杯薄暮飞行太淡了。”",
                "“……正好。”",
                "“那还要加苦味素和黄瓜片吗？”",
                "“……加。”"
            ],
            "recipe": [
                "熊熊杯",
                "薄暮飞行",
                "苦味素",
                "偏淡",
                "黄瓜片",
                "空心圆匙"
            ]
        }
    ],
    "hignRapport": [
        {
            "needLevel": 1,
            "recipe": [
                "蜂蜜啤酒",
                "偏淡",
                "多冰"
            ],
            "ex": [450, 504, 549],//参考默契值，无加，满家具，满加成
        },
        {
            "needLevel": 5,
            "recipe": [
                "黑月亮",
                "盐",
                "多冰",
                "樱桃"
            ],
            "ex": [513, 574, 626],//参考默契值，无加，满家具，满加成
        },
        {
            "needLevel": 10,
            "recipe": [
                "黎威尔日升",
                "椰浆",
                "盐",
                "青梅"
            ],
            "ex": [527, 591, 644],//参考默契值，无加，满家具，满加成
        }
    ]
}

const 吉娜 = {
    "desc": Desc,
    "skill": Skill,
    "tea": Tea
}

export { 吉娜 }