import { SkillColorEnum } from '../enum/skillSimpleEnum.ts';
import { ToastSkillEnum } from '../enum/toastSkillEnum.ts';
import { MXLaohenEnum } from '../enum/laohenNameEnum.ts';
import { speSkillCon } from '../consts/SkillCon.ts';

const Desc = {
    "job": "轻卫", "skill": [MXLaohenEnum.昂扬斗志方块α型, MXLaohenEnum.战斗反射], "attr": "wuli", "star": "4",
    "nameEn": "RODNEY", "tag": ["输出", "防护"], "originWorld": "森罗", "orginChar": "原创",
    "cv": "马正阳", "openDate": "2024年01月12日", "resourse": ["常态共鸣"],
    "introText": "你好我是唐路遥，鹿路运输——稍等一下，我接个电话。什么，北洛又被开罚单了？不是说好了这趟让紫——什么？！<br>算了算了，等我过来处理吧……",
    "tacgie": {
        "name": "初始外装",
        "listNames": ["立绘", "3D"],
        "imgs": [
            "4/42/evfgrmlntltxvkuvlm0p5r5jdl1s28h.png",
            "6/61/rok1ns8lp3rm7zxo7s55b51z9n73851.png"
        ]
    }
}

const Skill = [
    {
        "name": "压力上升中…",
        "aliasNum": "1",//技能简称，1技能
        "maxLevel": 15,//技能最大等级
        "detail": {
            "type": "主动技能",//技能类型，主动、被动、自定等
            "skillTab": [["指令冷却", "15秒"], ["次数", "4"]],//技能使用情况，如冷却，可使用次数
            "tab": ["自身增益", "最大选敌数8", "对空"],//技能标签
            "sizeLevel": [
                ["24%~40%", "15%"],
                ["24%~40%", "17%"],
                ["24%~40%", "20%"],
                ["24%~40%", "22%"],
                ["24%~40%", "24%"],
                ["27%~45%", "26%"],
                ["27%~45%", "29%"],
                ["27%~45%", "31%"],
                ["30%~50%", "33%"],
                ["30%~50%", "35%"],
                ["30%~50%", "36%"],
                ["30%~50%", "38%"],
                ["30%~50%", "39%"],
                ["30%~50%", "40%"],
                ["30%~50%", "40%"],
            ],
            "content": [
                "主动",
                speSkillCon("[嘲讽]", SkillColorEnum.normal, ToastSkillEnum.嘲讽),
                "周围8名敌人攻击自己（优先",
                speSkillCon("[嘲讽]", SkillColorEnum.normal, ToastSkillEnum.嘲讽),
                "靠近自己的敌方单位），受",
                speSkillCon("[嘲讽]", SkillColorEnum.normal, ToastSkillEnum.嘲讽),
                "的目标对自身造成的伤害降低",
                speSkillCon("", 0, -1, 0),
                speSkillCon("（[防御依赖]）", SkillColorEnum.normal, ToastSkillEnum.防御依赖),
                speSkillCon("（减伤乘区·受伤害减少）", SkillColorEnum.injuries),
                "，持续",
                speSkillCon("15"),
                "秒，同时获得自身",
                speSkillCon("", 0, -1, 1),
                "最大生命值的护盾"
            ]//满级技能内容描述
        }
    },
    {
        "name": "理智崩断中…",
        "aliasNum": "2",
        "maxLevel": 15,
        "detail": {
            "type": "自动技能",
            "skillTab": [["施放冷却", "-"], ["施放条件", "20愤怒值"]],
            "tab": ["伤害", "格挡条破坏3"],
            "sizeLevel": [
                ["1050%"],
                ["1208%"],
                ["1365%"],
                ["1523%"],
                ["1680%"],
                ["1838%"],
                ["1995%"],
                ["2153%"],
                ["2310%"],
                ["2415%"],
                ["2520%"],
                ["2625%"],
                ["2678%"],
                ["2730%"],
                ["2783%"]
            ],
            "content": [
                "每次普通攻击或者受击时积累:",
                speSkillCon("1"),
                "点",
                speSkillCon("[愤怒值]", SkillColorEnum.normal, ToastSkillEnum.愤怒值),
                "，",
                speSkillCon("[愤怒值]", SkillColorEnum.normal, ToastSkillEnum.愤怒值),
                "达",
                speSkillCon("20"),
                "点后对正前方扇形范围内所有敌方进行反复抽打，造成",
                speSkillCon("", 0, -1, 0),
                speSkillCon("最终攻击的物理伤害"),
                "；若目标受到自身",
                speSkillCon("[嘲讽]", SkillColorEnum.normal, ToastSkillEnum.嘲讽),
                "效果影响，则受到的伤害提高",
                speSkillCon("30%"),
                speSkillCon("（增伤乘区·独立增伤）", SkillColorEnum.injuries),
                "，该伤害视为普通攻击伤害",
                "",
                "激活格挡能力时，对目标额外造成",
                speSkillCon("100%"),
                "格挡强度的物理伤害"
            ]
        }
    },
    {
        "name": "爱咋咋地吧！",
        "aliasNum": "异核",
        "maxLevel": 6,
        "detail": {
            "type": "异核技能",
            "skillTab": [["充能时间", "60秒"]],
            "tab": ["伤害", "自身增益"],
            "sizeLevel": [
                ["45%", "60%", "4%"],
                ["50%", "70%", "6%"],
                ["55%", "80%", "8%"],
                ["60%", "90%", "10%"],
                ["60%", "95%", "10%"],
                ["60%", "100%", "10%"],
            ],
            "content": [
                "豪饮一瓶，对范围内的敌人总计造成",
                speSkillCon("1500%最终攻击的物理伤害"),
                "，之后攻击速度提升",
                speSkillCon("", 0, -1, 0),
                speSkillCon("（属性乘区·攻击速度）", SkillColorEnum.injuries),
                "，格挡强度提升",
                speSkillCon("", 0, -1, 1),
                "且格挡值回复速度提升",
                speSkillCon("100%"),
                "，自身技能和特性产生的护盾额外提高",
                speSkillCon("", 0, -1, 2),
                "，积累",
                speSkillCon("[愤怒值]", SkillColorEnum.normal, ToastSkillEnum.愤怒值),
                "效率提升100%，持续",
                speSkillCon("15"),
                "秒"
            ]
        }
    },
    {
        "name": "特性：一天都不休？",
        "aliasNum": "特性",//特性技能需要特殊处理，在具体的地方需要用v-if判断
        "detail": {
            "type": "战斗特性",
            "tab": [["射程", "200"], ["攻击速度", "0.59次每秒"]],
            "atType": ["单体"],
            "content": [
                "攻击面前的目标造成",
                speSkillCon("204%最终攻击的物理伤害")
            ],//普通攻击
            "specialContent": [
                [
                    "生命值低于",
                    speSkillCon("70%"),
                    "，激活格挡能力，且受到的治疗",
                    speSkillCon("50%"),
                    "转化为等额护盾，若15秒内未受到攻击，消耗技能和特性产生的所有护盾为唐路遥回复等额生命值，并退出格挡状态",
                    "",
                    "激活格挡能力时，自身技能和特性产生的护盾提升",
                    speSkillCon("20%"),
                    "，积累",
                    speSkillCon("[愤怒值]", SkillColorEnum.normal, ToastSkillEnum.愤怒值),
                    "效率提高",
                    speSkillCon("100%")
                ],//零花本体特性
                [
                    "激活格挡能力时，额外获得自身",
                    speSkillCon("40%"),
                    "最大生命值的护盾，且15秒内未受到攻击时，技能和特性产生的所有护盾不会消失"
                ],//一花特性
                [
                    "生命值低于",
                    speSkillCon("90%"),
                    "时激活格挡能力，且自身技能和特性产生的护盾提升至",
                    speSkillCon("30%")
                ]//三花特性
            ]
        }
    }
]

const Tea = {
    "achievement": [
        {
            "name": "为“父”艰难",
            "limit": "【默契值1级】",
            "tips": [
                "“兄弟，你也是帮小孩拿周边的？”",
                "“为了那什么BS，这已经是我这礼拜的第四杯双莓之恋了。早知道要喝这么多，我也和你一样点三分糖、少冰了。”",
                "“我们当爹的就是难啊——”",
                "唐路遥看了眼不远处正晃悠着联动钥匙扣的无咎，终究还是没反驳。"
            ],
            "recipe": [
                "经典搪瓷杯",
                "双莓之恋",
                "双倍糖",
                "多冰",
                "椰果",
                "长匙"
            ]
        },
        {
            "name": "严格标准",
            "limit": "【默契值1级】",
            "tips": [
                "“饮料？你们点吧，我得赶回去填份报表。急用。”",
                "“唐经理，真的不尝尝新品吗？就是带酒精……”",
                "“……用的什么酒？”",
                "“甜米酒？”",
                "“也行吧！五分糖，少冰，再加一片银杏叶。我拿回去逗鸟玩。”"
            ],
            "recipe": [
                "航海时代",
                "酒酿凤梨",
                "五分糖",
                "少冰",
                "银杏叶"
            ]
        },
        {
            "name": "大危机？",
            "limit": "【默契值1级】",
            "tips": [
                "“唐经理看着有些面熟啊，我们是不是在Deap Ocean见过？”",
                "“啊哈哈齐总真是幽默——”",
                "“你连续一个月点了‘黑月亮’……”",
                "“……”",
                "“多冰，加盐，加蓝莓，对吗？”",
                "“我想您一定是看错了。我最近都在加班，哪有空去D……D什么来着？”",
                "“也是。Deap Ocean里那个小伙可热情有趣多了。”",
                "“哈哈。啊哈哈。”"
            ],
            "recipe": [
                "扎啤杯",
                "黑月亮",
                "多冰",
                "盐",
                "蓝莓",
                "圆柄长签"
            ]
        },
        {
            "name": "老样子",
            "limit": "【默契值5级】",
            "tips": [
                "“唐经——”",
                "“嘘！小声些！我可不想让鹿路运输的人知道我在你这喝些配方都不公开的酒。”",
                "“那你……今天还来吗？”",
                "“当然来！老样子。加一份苦味素和奇异果片。”"
            ],
            "recipe": [
                "经典搪瓷杯",
                "极夜马戏团",
                "苦味素",
                "偏烈",
                "奇异果片",
                "菊花"
            ]
        },
        {
            "name": "幻想时间",
            "limit": "【默契值8级】",
            "tips": [
                "每当提及加班期结束后的安排，唐经理总显得有些……过于兴奋。",
                "“监督你说，去黎威尔看日出怎么样？”",
                "“那个……各个方面来说都不可能……还是再来一杯吧，加奶精球、草莓、柠檬汁？”",
                "“还有纸伞！”"
            ],
            "recipe": [
                "扎啤杯",
                "黎威尔日升",
                "奶精球",
                "柠檬汁",
                "草莓",
                "精致纸伞"
            ]
        },
        {
            "name": "同是深夜加班人",
            "limit": "【默契值10级】",
            "tips": [
                "3点38，办公室里忽然传来一阵脚步声，监督连头也没回。",
                "“早啊，唐经理。来一杯吗？特浓？”",
                "“……双份浓缩，多帮我抓两个糖包。”"
            ],
            "recipe": [
                "航海时代",
                "经典特浓咖啡",
                "糖包",
                "加双份",
                "原味雪顶",
                "水果签"
            ]
        },
        {
            "name": "大人的心得",
            "limit": "【默契值16级】",
            "tips": [
                "加班的日子比咖啡还苦，必须佐酒送服。",
                "可即便如此，唐经理还是坚持在自己的马克杯上摆几根充满仪式感的迷迭香。"
            ],
            "recipe": [
                "棱纹马克杯",
                "恩利都苦啤兑苦咖",
                "少冰",
                "苦味素",
                "加双份",
                "迷迭香"
            ]
        }
    ],
    "hignRapport": [
        {
            "needLevel": 1,
            "recipe": [
                "黑月亮",
                "柠檬汁",
                "多冰",
                "樱桃"
            ],
            "ex": [362, 406, 442, 483],//参考默契值，无加，满家具，满加成
        },
        {
            "needLevel": 5,
            "recipe": [
                "极夜马戏团",
                "柠檬汁",
                "偏烈",
                "樱桃"
            ],
            "ex": [523, 586, 639, 697],//参考默契值，无加，满家具，满加成
        },
        {
            "needLevel": 18,
            "recipe": [
                "惑星的艾琳",
                "柠檬汁",
                "咖啡雪顶"
            ],
            "ex": [540, 604, 659, 719],//参考默契值，无加，满家具，满加成
        }
    ]
}

const 唐路遥 = {
    "desc": Desc,
    "skill": Skill,
    "tea": Tea
}

export { 唐路遥 }