import { SkillColorEnum } from '../enum/skillSimpleEnum.ts';
import { ToastSkillEnum } from '../enum/toastSkillEnum.ts';
import { MXLaohenEnum, LaohenNameEnum } from '../enum/laohenNameEnum.ts';
import { speSkillCon } from '../consts/SkillCon.ts';

const Desc = {
    "job": "战术家", "skill": [MXLaohenEnum.异核过载, MXLaohenEnum.暗影伏击], "attr": "shi", "star": "6",
    "nameEn": "MRS.GEM", "tag": ["输出", "召唤", "群攻"], "originWorld": "森罗、克图尔特", "orginChar": "原创",
    "cv": "", "openDate": "2025年10月23日",
    "resourse": ["定向共鸣·血色丝序"], "laohenLink": LaohenNameEnum.为伍,
    "introText": "嗯？您这次前来，恐怕不是为了商讨西陵重工与白荆科技的合作事宜吧——小先知是为红珠而来吗？",
    "tacgie": {
        "name": "初始外装",
        "listNames": ["立绘", "S4立绘", "3D"],
        "imgs": [
            "6/65/jv5w9jxiyis6u96tv4o1jppwcxrbfdo.png",
            "a/a5/8g7uvlp5ziz4o47ntlso4c2234y02o7.png",
            "f/f3/j6fqmcbptekaeeh8dcdjg2q50i2my89.png"
        ],
    }
}

const Skill = [
    {
        "name": "织幕",
        "aliasNum": "1",//技能简称，1技能
        "maxLevel": 15,//技能最大等级
        "detail": {
            "type": "主动技能",//技能类型，主动、被动、自定等
            "skillTab": [["指令冷却", "18秒"], ["次数", "5"]],//技能使用情况，如冷却，可使用次数
            "tab": ["伤害", "拦截", "对空"],//技能标签
            "sizeLevel": [
                ["1000%", "600%"],
                ["1150%", "690%"],
                ["1300%", "780%"],
                ["1450%", "870%"],
                ["1600%", "960%"],
                ["1750%", "1050%"],
                ["1900%", "1140%"],
                ["2050%", "1230%"],
                ["2200%", "1320%"],
                ["2300%", "1380%"],
                ["2400%", "1440%"],
                ["2500%", "1500%"],
                ["2600%", "1560%"],
                ["2700%", "1620%"],
                ["2800%", "1680%"]
            ],
            "content": [
                "指挥机械蜘蛛对矩形范围内的敌人造成",
                speSkillCon("", 0, -1, 0),
                speSkillCon("最终攻击的蚀元素伤害"),
                "，并呼唤灰锈对",
                speSkillCon("300"),
                "范围内的敌人造成",
                speSkillCon("", 0, -1, 1),
                speSkillCon("最终攻击的蚀元素伤害"),
                "，同时摧毁范围内投射物，并为终端附加",
                speSkillCon("20点蚀爆值")
            ]//满级技能内容描述
        }
    },
    {
        "name": "丝囚",
        "aliasNum": "2",
        "maxLevel": 15,
        "detail": {
            "type": "主动技能",
            "skillTab": [["指令冷却", "1秒"], ["次数", "∞"]],
            "tab": ["伤害", "负面状态", "对空"],
            "sizeLevel": [
                ["600%", "480%"],
                ["690%", "550%"],
                ["780%", "620%"],
                ["870%", "700%"],
                ["960%", "770%"],
                ["1050%", "840%"],
                ["1140%", "910%"],
                ["1230%", "980%"],
                ["1320%", "1060%"],
                ["1380%", "1100%"],
                ["1440%", "1150%"],
                ["1500%", "1200%"],
                ["1560%", "1250%"],
                ["1620%", "1300%"],
                ["1680%", "1340%"]
            ],
            "content": [
                "自动：每隔",
                speSkillCon("20"),
                "秒可以获得一次【丝囚】主动技能使用次数，使用后产生的指令冷却时间极短",
                "",
                "",
                "主动：指挥机械蜘蛛落到目标区域，对半径",
                speSkillCon("300"),
                "范围内的敌人造成",
                speSkillCon("", 0, -1, 0),
                speSkillCon("最终攻击的蚀元素伤害"),
                "，为终端附加",
                speSkillCon("15点蚀爆值"),
                "，并在目标区域留下持续",
                speSkillCon("12"),
                "秒的蛛网，同时自身周围也产生蛛网（当角色重伤或离场时，区域消失）",
                "",
                "",
                "蛛网持续期间：",
                "",
                "三角、菱形职业的同调者（包含自己）在蛛网上，能够进入",
                speSkillCon("[隐匿]", SkillColorEnum.normal, ToastSkillEnum.隐匿),
                "状态",
                "",
                "每秒对区域内的敌人造成",
                speSkillCon("", 0, -1, 1),
                speSkillCon("最终攻击的蚀元素伤害"),
                "（重叠区域伤害不叠加），并使蛛网区域内地面上的敌人降低",
                speSkillCon("70%"),
                speSkillCon("[移动速度]", SkillColorEnum.normal, ToastSkillEnum.移动速度)
            ]
        }
    },
    {
        "name": "血茧",
        "aliasNum": "异核",
        "maxLevel": 6,
        "detail": {
            "type": "异核技能",
            "skillTab": [["充能时间", "60秒"]],
            "tab": ["伤害", "自身增益", "对空"],
            "sizeLevel": [
                ["3000%", "600%"],
                ["3500%", "700%"],
                ["4000%", "800%"],
                ["4500%", "900%"],
                ["4750%", "950%"],
                ["5000%", "1000%"]
            ],
            "content": [
                "波丝对目标半径",
                speSkillCon("500"),
                "范围的敌人造成",
                speSkillCon("", 0, -1, 0),
                speSkillCon("最终攻击的蚀元素伤害"),
                "，灰绣对路径上的敌人造成",
                speSkillCon("", 0, -1, 1),
                speSkillCon("最终攻击的蚀元素伤害"),
                "。若命中敌方目标在蛛网内，则额外造成一次相当于",
                speSkillCon("5"),
                "秒蛛网总伤害的蚀元素伤害。",
                "",
                "释放技能后，接下来的",
                speSkillCon("20"),
                "秒内，场上蚀元素同调者（包含自己）进行普通攻击时，为终端额外附加",
                speSkillCon("10点蚀爆值"),
                "，总计最多可以获得",
                speSkillCon("200"),
                "点蚀爆值（当红珠重伤或离场时，此效果消失）",
                "",
                "战术家：开场充能50%"
            ]
        }
    },
    {
        "name": "特性：自缚一线",
        "aliasNum": "特性",//特性技能需要特殊处理，在具体的地方需要用v-if判断
        "detail": {
            "type": "战斗特性",
            "tab": [["射程", "800"], ["攻击速度", "0.50次每秒"]],
            "atType": ["单体"],
            "content": [
                "指挥机械蜘蛛对当前目标造成",
                speSkillCon("200%最终攻击的蚀元素伤害"),
                "，为终端附加",
                speSkillCon("3点蚀爆值"),
                "",
                "目标在自身近战范围内时，下次普通攻击会呼唤灰绣进行攻击，对",
                speSkillCon("300"),
                "范围内的敌人造成",
                speSkillCon("200%最终攻击的蚀元素伤害"),
                "",
                "并击退敌人（每30秒最多触发一次）"
            ],//普通攻击
            "specialContent": [
                [
                    "机械蜘蛛视为[召唤物]，且灰绣造成的伤害视为[召唤物伤害]",
                    "",
                    "当自身在",
                    speSkillCon("[隐匿]", SkillColorEnum.normal, ToastSkillEnum.隐匿),
                    "状态中，每秒提高伤害",
                    speSkillCon("5%"),
                    speSkillCon("（增伤乘区·独立增伤）", SkillColorEnum.injuries),
                    "，最多可以达到",
                    speSkillCon("40%"),
                    speSkillCon("（增伤乘区·独立增伤）", SkillColorEnum.injuries)
                ],//零花本体特性
                [
                    "登场时【丝囚】自动技能初始充能",
                    speSkillCon("20"),
                    "秒。",
                    "",
                    "蛛网的范围提高至",
                    speSkillCon("400"),
                    "，持续时间提高至",
                    speSkillCon("20"),
                    "秒，异核触发的蛛网伤害由",
                    speSkillCon("5"),
                    "秒提高至",
                    speSkillCon("10"),
                    "秒"
                ],//一花特性
                [
                    "当自身在",
                    speSkillCon("[隐匿]", SkillColorEnum.normal, ToastSkillEnum.隐匿),
                    "状态中，每秒提高伤害由",
                    speSkillCon("5%"),
                    speSkillCon("（增伤乘区·独立增伤）", SkillColorEnum.injuries),
                    "提高至",
                    speSkillCon("10%"),
                    speSkillCon("（增伤乘区·独立增伤）", SkillColorEnum.injuries),
                    "，上限提高至",
                    speSkillCon("80%"),
                    speSkillCon("（增伤乘区·独立增伤）", SkillColorEnum.injuries),
                ]//三花特性
            ]
        }
    }
]

const Tea = {
    "achievement": [
        {
            "name": "谨慎",
            "limit": "【默契值1级】",
            "tips": [
                "“你看起来对酸梅汤格外抗拒？”",
                "“人对于成长过程中没接触过的食物总是比较警惕。”",
                "“不好奇吗？”",
                "“不了。在我的认知中，未知往往象征着无尽的危险。”"
            ],
            "recipe": [
                "鎏·金",
                "冰镇酸梅汤",
                "三分糖",
                "珍珠",
                "空心圆匙"
            ]
        },
        {
            "name": "好处",
            "limit": "【默契值1级】",
            "tips": [
                "“没想到你会喝白桃芝士奶盖这么寻常的饮品。”",
                "“嫘祖女士推荐的，总要一试。”",
                "“哦？她是怎么说动你的？”",
                "“她说培养一些拟人的习惯，总归有好处。”"
            ],
            "recipe": [
                "经典格纹",
                "白桃芝士奶盖",
                "正常糖",
                "少冰",
                "青提",
                "蝴蝶结"
            ]
        },
        {
            "name": "气息",
            "limit": "【默契值5级】",
            "tips": [
                "“这杯沉金记忆怎么样？”",
                "“味道不错，名字糟糕”",
                "“你一直皱着眉，居然是因为名字吗？”",
                "“不同的名字有着不同的气息。记忆……它的气息，我尤为不喜。”"
            ],
            "recipe": [
                "经典格纹",
                "沉金记忆",
                "五分糖",
                "苦味素",
                "水果签"
            ]
        },
        {
            "name": "高塔之外",
            "limit": "【默契值13级】",
            "tips": [
                "“灰锈，你在微笑欸——看来你很满意这杯青草薄荷？”",
                "“它让我想起了一些……高塔之外的生活。”",
                "“听上去它们对你很重要。”",
                "“不再重要了。”",
                "“……？你讲话有时候真的很玄乎啊……”"
            ],
            "recipe": [
                "青叶陶瓷杯",
                "青草薄荷",
                "多冰",
                "偏烈",
                "蓝莓",
                "心形插签"
            ]
        },
        {
            "name": "与蛛同行",
            "limit": "【默契值8级】",
            "tips": [
                "“看来我们的朋友，很喜欢这杯杨枝甘露。”",
                "“……还好今天茶憩只有我们两个人，不然别人看到你拿出这只蜘蛛，早就尖叫起来了。”"
            ],
            "recipe": [
                "淑女风尚",
                "杨枝甘露",
                "原味雪顶",
                "椰果",
                "三叶长签"
            ]
        },
        {
            "name": "混沌",
            "limit": "【默契值10级】",
            "tips": [
                "“似曾相识的味道……”",
                "“也许你听说过极夜马戏团？”",
                "“不，我从未听说过这个名字，但我熟知这种混沌的气息。我想我们颇有渊源。”"
            ],
            "recipe": [
                "淑女风尚",
                "极夜马戏团",
                "柠檬汁",
                "正常",
                "樱桃",
                "银杏叶"
            ]
        },
        {
            "name": "不同",
            "limit": "【默契值18级】",
            "tips": [
                "“灰锈对拿铁避之不及，你却对特浓咖啡爱不释手……真是有趣。”",
                "“不管再相像，我们终究是两个人，小先知。”"
            ],
            "recipe": [
                "青叶陶瓷杯",
                "经典特浓咖啡",
                "奶精球",
                "标准",
                "香蕉冰淇淋",
                "心形插签"
            ]
        }
    ],
    "hignRapport": [
        {
            "needLevel": 1,
            "recipe": [
                "薄荷蜜柚苏打",
                "多冰",
                "咸梅干"
            ],
            "ex": [567],//参考默契值，无加，满家具，满加成
        }
    ]
}

const 红珠小姐 = {
    "desc": Desc,
    "skill": Skill,
    "tea": Tea
}

export { 红珠小姐 }