import { SkillColorEnum } from '../enum/skillSimpleEnum.ts';
import { MXLaohenEnum } from '../enum/laohenNameEnum.ts';
import { speSkillCon } from '../consts/SkillCon.ts';

const Desc = {
    "job": "护佑者", "skill": [MXLaohenEnum.落井下石, MXLaohenEnum.润物无声], "attr": "shui", "star": "4",
    "nameEn": "CHANGYAO", "tag": ["治疗", "控场"], "originWorld": "海错", "orginChar": "原创",
    "cv": "忙音", "openDate": "2024年01月12日", "resourse": ["常态共鸣"]
}

const Skill = [
    {
        "name": "闭门蟹客",
        "aliasNum": "1",//技能简称，1技能
        "maxLevel": 12,//技能最大等级
        "detail": {
            "type": "主动技能",//技能类型，主动、被动、自定等
            "skillTab": [["指令冷却", "18秒"], ["次数", "3"]],//技能使用情况，如冷却，可使用次数
            "tab": ["水区域", "负面状态", "伤害"],//技能标签
            "content": [
                "向目标位置发射泡泡，在目标位置留下水元素区域。",
                "",
                "泡泡会将目标点半径",
                speSkillCon("150"),
                "范围内的敌人困在空中，持续",
                speSkillCon("5"),
                "秒后泡泡碎裂，对半径",
                speSkillCon("150"),
                "范围内的敌人造成",
                speSkillCon("875%最终攻击的水元素伤害"),
                "（该效果对精英、首领级别敌人无效）"
            ]//满级技能内容描述
        }
    },
    {
        "name": "蟹手回春",
        "aliasNum": "2",
        "maxLevel": 12,
        "detail": {
            "type": "自动技能",
            "skillTab": [["施放冷却", "5秒"]],
            "tab": ["回复"],
            "content": [
                "治疗当前生命值百分比最低的两名友方同调者",
                speSkillCon("250%治愈力"),
                "的生命值"
            ]
        }
    },
    {
        "name": "绮光万象",
        "aliasNum": "异核",
        "maxLevel": 6,
        "detail": {
            "type": "异核技能",
            "skillTab": [["充能时间", "60秒"]],
            "tab": ["回复"],
            "content": [
                "每3秒治疗所有友方同调者",
                speSkillCon("150%治愈力"),
                "的生命值，总计会产生10次治疗效果"
            ]
        }
    },
    {
        "name": "特性：治愈气泡",
        "aliasNum": "特性",//特性技能需要特殊处理，在具体的地方需要用v-if判断
        "detail": {
            "type": "战斗特性",
            "tab": [["射程", "800"], ["攻击速度", "0.48次每秒"]],
            "atType": ["单体", "对空"],
            "content": [
                "向当前目标发射泡泡弹造成",
                speSkillCon("210%最终攻击的水元素伤害")
            ],//普通攻击
            "specialContent": [
                [
                    "可以治疗友方同调者"
                ],//零花本体特性
                [
                    "主动技能【闭门蟹客】效果范围额外扩大",
                    speSkillCon("100")
                ],//一花特性
                [
                    "治愈力提升",
                    speSkillCon("25%"),
                    speSkillCon("（属性乘区·治愈力加成）", SkillColorEnum.injuries)
                ]//三花特性
            ]
        }
    }
]

const Tea = {
    "achievement": [
        {
            "name": "气泡消失术",
            "limit": "【默契值1级】",
            "tips": [
                "“唔……谣谣想要一杯没有那么多气泡的凉凉的有点咸咸的苏打水！”",
                "“怎么这么多定语……”",
                "“还想要圆圆的长匙装饰！”",
                "“那又是什么……”"
            ],
            "recipe": [
                "简约至上/竹节茶杯",
                "薄荷蜜柚苏打",
                "多冰",
                "咸梅干",
                "圆匙"
            ]
        },
        {
            "name": "好椰好耶",
            "limit": "【默契值1级】",
            "tips": [
                "椰子风味加倍的独特饮品，不过小孩子最好还是注意咖啡因的摄入量。"
            ],
            "recipe": [
                "好椰拿铁",
                "椰浆",
                "低因"
            ]
        },
        {
            "name": "怪味可可",
            "limit": "【默契值5级】",
            "tips": [
                "普通的茶杯里是不普通的甜味饮品。",
                "或许不只是甜味，还有生姜和椰子的味道……"
            ],
            "recipe": [
                "竹节茶杯",
                "姜汁可可",
                "多冰",
                "椰浆"
            ]
        },
        {
            "name": "咖啡还是巧克力？",
            "limit": "【默契值1级】",
            "tips": [
                "明明是巧克力，却是满满的咖啡味……",
                "长谣还说想要一个小装饰，但是却拒绝透露具体想要什么。",
                "“猜小孩子的心思也是大人的工作嘛。”"
            ],
            "recipe": [
                "简约至上/竹节茶杯",
                "巧克力风暴",
                "咖啡雪顶",
                "咖啡冻",
                "精致纸伞"
            ]
        },
        {
            "name": "到底甜不甜",
            "limit": "【默契值16级】",
            "tips": [
                "当长谣被问起到底是更喜欢柚子还是更喜欢雪顶时，她沉默了很久才抬起头，说了句看似风马牛不相及的话。",
                "“不会又是无糖吧。”"
            ],
            "recipe": [
                "柚柚切颗NOW",
                "无糖",
                "原味雪顶"
            ]
        },
        {
            "name": "实现熊熊自由",
            "limit": "【默契值18级】",
            "tips": [
                "最喜欢的杯子装搭配最喜欢的饮品，再配上一枚蝴蝶结吧。",
                "“谣谣其实不太喜欢饮料里面加奇怪的东西，但是这次就算啦。”",
                "“那块饼干明明是你自己偷偷放进去的。”"
            ],
            "recipe": [
                "熊熊杯",
                "熊熊燕麦牛奶",
                "燕麦奶",
                "汪汪饼干",
                "蝴蝶结"
            ]
        },
        {
            "name": "普通冻柠茶",
            "limit": "【默契值1级】",
            "tips": [
                "鹿路运输的标志随着冰块沉浮，长谣拿起一片枫叶——",
                "插在了辛西亚头上。"
            ],
            "recipe": [
                "简约至上/竹节茶杯",
                "鹿鹿冻柠茶",
                "五分糖",
                "正常冰",
                "枫叶"
            ]
        }
    ],
    "hignRapport": [
        {
            "needLevel": 1,
            "recipe": [
                "酒酿凤梨/鹿鹿冻柠茶",
                "五分糖",
                "少冰"
            ],
            "ex": [399, 447, 487],//参考默契值，无加，满家具，满加成
        },
        {
            "needLevel": 8,
            "recipe": [
                "白桃芝士奶盖",
                "五分糖",
                "少冰",
                "青提"
            ],
            "ex": [411, 460, 502],//参考默契值，无加，满家具，满加成
        },
        {
            "needLevel": 16,
            "recipe": [
                "柚柚切颗NOW",
                "五分糖",
                "原味雪顶"
            ],
            "ex": [495, 554, 604],//参考默契值，无加，满家具，满加成
        }
    ]
}

const 长谣 = {
    "desc": Desc,
    "skill": Skill,
    "tea": Tea
}

export { 长谣 }