import { SkillColorEnum } from '../enum/skillSimpleEnum.ts';
import { ToastSkillEnum } from '../enum/toastSkillEnum.ts';
import { MXLaohenEnum } from '../enum/laohenNameEnum.ts';
import { speSkillCon } from '../consts/SkillCon.ts';

const Desc = {
    "job": "护佑者", "skill": [MXLaohenEnum.核心充能菱形α型, MXLaohenEnum.冻结延长], "attr": "shuang", "star": "5",
    "nameEn": "NOLA", "tag": ["治疗", "控场"], "originWorld": "黎威尔", "orginChar": "古剑奇谭网络版",
    "cv": "叶知秋", "openDate": "2024年01月12日", "resourse": ["常态共鸣"]
}

const Skill = [
    {
        "name": "早春祷歌",
        "aliasNum": "1",//技能简称，1技能
        "maxLevel": 12,//技能最大等级
        "detail": {
            "type": "主动技能",//技能类型，主动、被动、自定等
            "skillTab": [["指令冷却", "20秒"], ["次数", "4"]],//技能使用情况，如冷却，可使用次数
            "tab": ["回复"],//技能标签
            "content": [
                "对全体友方同调者进行「持续治疗」，每秒治疗目标",
                speSkillCon("68%治愈力"),
                "的生命值，持续",
                speSkillCon("15"),
                "秒"
            ]//满级技能内容描述
        }
    },
    {
        "name": "冬的挽留",
        "aliasNum": "2",
        "maxLevel": 12,
        "detail": {
            "type": "自动技能",
            "skillTab": [["施放冷却", "20秒"]],
            "tab": ["伤害", "负面状态"],
            "content": [
                "在指定位置制造半径",
                speSkillCon("300"),
                "范围的暴风雪区域，每0.5秒对区域内的敌人造成",
                speSkillCon("158%最终攻击的霜元素伤害"),
                "，持续",
                speSkillCon("10"),
                "秒"
            ]
        }
    },
    {
        "name": "鼬的报恩",
        "aliasNum": "异核",
        "maxLevel": 6,
        "detail": {
            "type": "异核技能",
            "skillTab": [["充能时间", "60秒"]],
            "tab": ["自身增益", "友方增益", "回复", "持续施法"],
            "content": [
                "持续施法对全场生命值百分比最低的三名友方同调者进行治疗，每秒治疗目标",
                speSkillCon("240%治愈力"),
                "的生命值，持续",
                speSkillCon("6"),
                "秒",
                "",
                "同时提升全场友方同调者",
                speSkillCon("30%[同调者攻击速度]", SkillColorEnum.normal, ToastSkillEnum.同调者攻击速度),
                speSkillCon("（属性乘区·攻击速度）", SkillColorEnum.injuries),
                "，持续",
                speSkillCon("10"),
                "秒"
            ]
        }
    },
    {
        "name": "特性：与维瑟尔约定",
        "aliasNum": "特性",//特性技能需要特殊处理，在具体的地方需要用v-if判断
        "detail": {
            "type": "战斗特性",
            "tab": [["射程", "800"], ["攻击速度", "0.60次每秒"]],
            "atType": ["单体", "对空"],
            "content": [
                "向当前目标发射雪球或冰锥，造成",
                speSkillCon("165%最终攻击的霜元素伤害"),
                "",
                "目标在自身近战范围内时，下次普通攻击替换为雪鼬扫尾，造成",
                speSkillCon("300%最终攻击的霜元素伤害"),
                "并以",
                speSkillCon("1级[位移强度]", SkillColorEnum.normal, ToastSkillEnum.位移强度),
                "击退范围内的所有敌人 (每20秒最多触发一次)"
            ],//普通攻击
            "specialContent": [
                [
                    "攻击对敌人附加移动速度降低",
                    speSkillCon("70%"),
                    "效果，持续",
                    speSkillCon("3"),
                    "秒"
                ],//零花本体特性
                [
                    "治愈力提升",
                    speSkillCon("25%"),
                    speSkillCon("（属性乘区·治愈力加成）", SkillColorEnum.injuries),
                    "，同时延长",
                    speSkillCon("5"),
                    "秒主动技能【早春祷歌】的持续时间"
                ],//一花特性
                [
                    "受到特性减速效果影响的单位遭受的伤害提高",
                    speSkillCon("10%"),
                    speSkillCon("（目标减益乘区·目标额外减伤降低）", SkillColorEnum.injuries)
                ]//三花特性
            ]
        }
    }
]

const Tea = {
    "achievement": [
        {
            "name": "将错就错",
            "limit": "【默契值1级】",
            "tips": [
                "“监督老师……你刚刚好像多放了一份苦味素……”",
                "“……”",
                "监督拿着手里笔直的玻璃杯，犹豫了一会，放了颗青提进去。"
            ],
            "recipe": [
                "柯林杯",
                "惑星的艾琳",
                "苦味素",
                "青提"
            ]
        },
        {
            "name": "创始人的“传奇”",
            "limit": "【默契值1级】",
            "tips": [
                "“……小幺，你尝一口……？”",
                "“小幺你怎么了小幺！”",
                "“……”第1892个被曲观玄特制饮品打败的人出现了，哦是动物。",
                "看来冰块奶精果冻也救不了它……"
            ],
            "recipe": [
                "姜汁可可",
                "多冰",
                "奶精球",
                "咖啡冻"
            ]
        },
        {
            "name": "提升记忆力",
            "limit": "【默契值13级】",
            "tips": [
                "“好困…………”",
                "“给，牛奶，给你换成了燕麦的。”",
                "“蝴蝶结好可爱……唔，监督老师！它能增强我的记忆力么！”",
                "“呃……睡个好觉可能也算？”"
            ],
            "recipe": [
                "环口杯",
                "甜牛乳",
                "无糖",
                "常温",
                "燕麦奶",
                "蝴蝶结"
            ]
        },
        {
            "name": "有求必应",
            "limit": "【默契值8级】",
            "tips": [
                "普通玻璃杯装满浓郁的巧克力，希望品尝到的人能有甜蜜的一天。",
                "“监督老师，请给我加一份雪顶，还有一份珍珠！”"
            ],
            "recipe": [
                "家用玻璃杯",
                "巧克力风暴",
                "咖啡雪顶",
                "珍珠",
                "五叶长签"
            ]
        },
        {
            "name": "奶油芭蕾",
            "limit": "【默契值13级】",
            "tips": [
                "“诶诶诶小幺你别往奶油里扑呀！”",
                "当阳铃把小幺从咖啡和鲜奶油中拯救出来时，小幺已经把薄荷叶塞到了嘴里。",
                "——一秒之后，吐了出来。"
            ],
            "recipe": [
                "环口杯",
                "奶油芭蕾",
                "脱脂牛奶",
                "正常",
                "加双份",
                "薄荷叶"
            ]
        },
        {
            "name": "“你的眼睛”",
            "limit": "【默契值16级】",
            "tips": [
                "阳铃听说这杯饮料很像自己的眼睛。",
                "她端起环口杯对着窗子，阳光让她不由得眯了眯眼睛。",
                "真好看。",
                "她喝了一口，想到了大海。",
                "“监督老师，我们去海边散步吧！”"
            ],
            "recipe": [
                "环口杯",
                "海水半蓝",
                "少冰",
                "盐",
                "茶冻",
                "长匙"
            ]
        },
        {
            "name": "注意措辞",
            "limit": "【默契值18级】",
            "tips": [
                "“好香的味道，监督老师你煮了什么？”",
                "“花茶，唔，要加点什么么，不过加水果冻的话可能会化掉。”",
                "“没关系，请再给我烧一根香！”",
                "“？？？”监督震惊了片刻反应过来，缓缓拿出了迷迭香。"
            ],
            "recipe": [
                "环口杯",
                "德里亚德风味花茶",
                "热",
                "蜜桃冻",
                "迷迭香"
            ]
        }
    ],
    "hignRapport": [
        {
            "needLevel": 1,
            "recipe": [
                "甜牛乳",
                "无糖",
                "常温",
                "全脂牛奶"
            ],
            "ex": [385, 431, 470],//参考默契值，无加，满家具，满加成
        },
        {
            "needLevel": 4,
            "recipe": [
                "青提啵啵奶茶",
                "五分糖",
                "少冰",
                "椰果"
            ],
            "ex": [420, 470, 512],//参考默契值，无加，满家具，满加成
        },
        {
            "needLevel": 6,
            "recipe": [
                "熊熊燕麦牛奶",
                "全脂牛奶",
                "椰果"
            ],
            "ex": [470, 526, 574],//参考默契值，无加，满家具，满加成
        },
        {
            "needLevel": 18,
            "recipe": [
                "德里亚德风味花茶",
                "常温",
                "茶冻"
            ],
            "ex": [495, 554, 604],//参考默契值，无加，满家具，满加成
        }
    ]
}

const 阳铃 = {
    "desc": Desc,
    "skill": Skill,
    "tea": Tea
}

export { 阳铃 }