import { SkillColorEnum } from '../enum/skillSimpleEnum.ts';
import { ToastSkillEnum } from '../enum/toastSkillEnum.ts';
import { MXLaohenEnum } from '../enum/laohenNameEnum.ts';
import { speSkillCon } from '../consts/SkillCon.ts';

const Desc = {
    "job": "游徒", "skill": [MXLaohenEnum.核心充能三角β型, MXLaohenEnum.核心蚀解], "attr": "shi", "star": "6",
    "nameEn": "LEILANI", "tag": ["输出", "爆发"], "originWorld": "森罗", "orginChar": "原创",
    "cv": "王晓彤", "openDate": "2024年06月27日", "resourse": ["定向共鸣·沉默的誓言"],
    "introText": "仓库管理员鸢已返岗，现正式向您报到，我回来了，监督。",
    "tacgie": {
        "name": "初始外装",
        "listNames": ["立绘", "S4立绘", "3D"],
        "imgs": [
            "a/ab/awfybjp0w4czwq6jx5e031q5jjwrbr4.png",
            "a/a9/m3gsczgbsxdf0y4bpxpnr1xe4dhqoq4.png",
            "8/81/h9cub1svbom3i2iokf4qgn8ew3330nc.png"
        ]
    }
}

const Skill = [
    {
        "name": "月巡",
        "aliasNum": "1",//技能简称，1技能
        "maxLevel": 12,//技能最大等级
        "detail": {
            "type": "主动技能",//技能类型，主动、被动、自定等
            "skillTab": [["指令冷却", "15秒"], ["次数", "4"]],//技能使用情况，如冷却，可使用次数
            "tab": ["伤害", "穿透屏障"],//技能标签
            "content": [
                "对自身前方扇形区域射出箭矢对半径1200范围内目标造成",
                speSkillCon("2500%最终攻击的蚀元素伤害"),
                "，伤害随目标当前生命值百分比提升，最高提升",
                speSkillCon("100%"),
                speSkillCon("（增伤乘区·独立增伤）", SkillColorEnum.injuries),
                "",
                "连击：无视当前蚀爆值触发一次相当于消耗",
                speSkillCon("100"),
                "点蚀爆值时",
                speSkillCon("50%"),
                "的蚀爆伤害"
            ]//满级技能内容描述
        }
    },
    {
        "name": "弦影",
        "aliasNum": "2",
        "maxLevel": 12,
        "detail": {
            "type": "主动技能",
            "skillTab": [["指令冷却", "15秒"], ["次数", "4"]],
            "tab": ["伤害", "自身增益"],
            "content": [
                "被动：每隔",
                speSkillCon("15"),
                "秒强化自身武器，使自身",
                speSkillCon("20"),
                "秒内普通攻击额外为终端附加",
                speSkillCon("5点蚀爆值"),
                "，并使普通攻击对命中目标周围",
                speSkillCon("200"),
                "半径同样造成伤害。若技能【月巡】的次数耗尽，则持续时间内额外提升自身",
                speSkillCon("100%"),
                speSkillCon("（属性乘区·攻击速度）", SkillColorEnum.injuries),
                "攻击速度",
                "",
                "",
                "主动：对选中区域半径400范围内的目标造成",
                speSkillCon("3750%最终攻击的蚀元素伤害"),
                "，并为终端附加",
                speSkillCon("10点蚀爆值"),
                "。同时以",
                speSkillCon("2级[位移强度]", SkillColorEnum.normal, ToastSkillEnum.位移强度),
                "击退自身周围300范围目标"
            ]
        }
    },
    {
        "name": "应许之箭",
        "aliasNum": "异核",
        "maxLevel": 6,
        "detail": {
            "type": "异核技能",
            "skillTab": [["充能时间", "60秒"]],
            "tab": ["伤害", "自身增益", "穿透屏障"],
            "content": [
                "对选中区域半径范围",
                speSkillCon("500"),
                "内目标造成",
                speSkillCon("4500%最终攻击的蚀元素伤害"),
                "，并内终端附加",
                speSkillCon("20点蚀爆值"),
                "，同时立即触发【弦影】的被动效果。",
                "",
                "异核技能若只命中单个目标，则对其额外造成",
                speSkillCon("2000%最终攻击的蚀元素伤害")
            ]
        }
    },
    {
        "name": "特性：弥辉",
        "aliasNum": "特性",//特性技能需要特殊处理，在具体的地方需要用v-if判断
        "detail": {
            "type": "战斗特性",
            "tab": [["射程", "800"], ["攻击速度", "0.35次每秒"]],
            "atType": ["单体", "对空"],
            "content": [
                "对目标发射箭矢，造成",
                speSkillCon("286%最终攻击的蚀元素伤害"),
                "，并为终端附加",
                speSkillCon("3点蚀爆值")
            ],//普通攻击
            "specialContent": [
                [
                    "触发蚀爆后，使自身所有伤害无视目标",
                    speSkillCon("10%"),
                    speSkillCon("（属性乘区·忽略减伤）", SkillColorEnum.injuries),
                    "基础减伤，最多叠加",
                    speSkillCon("3"),
                    "层"
                ],//零花本体特性
                [
                    "【弦影】被动效果激活时，普通攻击伤害提高",
                    speSkillCon("40%"),
                    speSkillCon("（增伤乘区·独立增伤）", SkillColorEnum.injuries),
                    "，且自身普通攻击使目标蚀元素抗性降低",
                    speSkillCon("15%"),
                    speSkillCon("（[目标减益乘区·目标抗性降低]）", SkillColorEnum.injuries, ToastSkillEnum.目标减益乘区目标抗性降低),
                    "，持续",
                    speSkillCon("20"),
                    "秒"
                ],//一花特性
                [
                    "目标生命值越低，鸢对目标造成的伤害越高，最多提高",
                    speSkillCon("40%"),
                    speSkillCon("（增伤乘区·独立增伤）", SkillColorEnum.injuries)
                ]//三花特性
            ]
        }
    }
]

const Tea = {
    "achievement": [
        {
            "name": "初印象",
            "limit": "【默契值13级】",
            "tips": [
                "加入白荆科技的第一天，鸢连同事都没见过几个，便被拉来了新人聚餐。",
                "半个小时后，她能做的就只有呆呆地望着眼前泛着气泡的沉金记忆。",
                "“如果不太适应这种场合，偷偷溜走也是可以的。”一个穿着蓝白制服的陌生人突然走到她的身边。",
                "“啊，可是……”这样似乎显得不太合群，她这么想着，没有说出口。",
                "身前的陌生人笑了笑，接过鸢手里的沉金记忆，一饮而尽。",
                "“不用担心，这里不合群的人比你想象中要多。”",
                "这就是鸢对监督的第一印象。"
            ],
            "recipe": [
                "经典搪瓷杯",
                "沉金记忆",
                "双倍糖",
                "柠檬汁",
                "心形插签"
            ]
        },
        {
            "name": "保守主义",
            "limit": "【默契值6级】",
            "tips": [
                "“一杯象征危险和未知的饮品吗……？”",
                "鸢望着手中的杯子，又加了些盐粒。",
                "“还是……平凡的生活更好。”"
            ],
            "recipe": [
                "航海时代",
                "极夜马戏团",
                "盐",
                "偏烈",
                "银杏叶"
            ]
        },
        {
            "name": "天降？青梅？",
            "limit": "【默契值5级】",
            "tips": [
                "“你怎么这副表情？”",
                "“只是觉得有些不可思议，这本小说中的主人公居然会为了刚认识的人去质疑自己的发小……”",
                "“……鸢，在‘天降’和‘青梅’之中，你是无条件选‘青梅’的那一派吧？”",
                "“应该……是的。”",
                "“嗯……我可能不应该选这杯惑星的艾琳给你。”"
            ],
            "recipe": [
                "扎啤杯",
                "惑星的艾琳",
                "苦味素",
                "青提",
                "迷迭香"
            ]
        },
        {
            "name": "家的味道",
            "limit": "【默契值10级】",
            "tips": [
                "每到绣球花开放的时节，福利院的孩子们便会开始央求院长为他们熬煮一些酸梅汤作为消暑饮品。",
                "院长总是欣然答应。",
                "在之后的几个月里，葵花福利院里总是弥漫着一股若有若无的酸甜香气。",
                "——这大概就是家的味道吧。",
                "鸢曾如此坚信。"
            ],
            "recipe": [
                "航海时代",
                "冰镇酸梅汤",
                "五分糖",
                "咸梅干",
                "圆柄长签"
            ]
        },
        {
            "name": "好员工",
            "limit": "【默契值1级】",
            "tips": [
                "“在这么多饮品里，你只想要一杯玻璃橘子吗？”",
                "“这样就好了。”",
                "“嗯，等下还要回去加班，不可以碰酒。”",
                "“有你这么自觉的员工，我都有些不好意思了……”"
            ],
            "recipe": [
                "棱纹马克杯",
                "玻璃橘子",
                "少冰",
                "芒果果冻",
                "樱花"
            ]
        },
        {
            "name": "病中往事",
            "limit": "【默契值16级】",
            "tips": [
                "七叶的身体一直不好，尤其是在小时候。",
                "她总是莫名其妙地发起烧来，然后整宿陷入高热之中。",
                "鸢什么也做不了，只能守在好友的床前，一遍一遍地热着那杯七叶最爱的甜牛奶。只为了她醒来时，能第一时间喝上。",
                "“圣西尔大人，拜托了，让七叶好起来啊……”"
            ],
            "recipe": [
                "扎啤杯",
                "甜牛乳",
                "正常糖",
                "热",
                "精致纸伞"
            ]
        },
        {
            "name": "体贴入微",
            "limit": "【默契值18级】",
            "tips": [
                "“一杯正常冰、加茶冻的薄荷蜜柚苏打？这不是最近大家每天都点的饮料嘛。鸢你也喜欢吗？”",
                "“其实，这是我第一次尝试……”",
                "“第一次？你之前没跟着他们一起点过？”",
                "“嗯，我想先自己私下尝尝。这样就算不太喜欢，下次和大家一起喝的时候也不会表现得太明显，扫了大家的兴。”",
                "“你这也太细致了……”"
            ],
            "recipe": [
                "棱纹马克杯",
                "薄荷蜜柚苏打",
                "正常冰",
                "茶冻",
                "三叶长签"
            ]
        }
    ],
    "hignRapport": [
        {
            "needLevel": 1,
            "recipe": [
                "玻璃橘子",
                "少冰",
                "椰果"
            ],
            "ex": [519, 582, 634],//参考默契值，无加，满家具，满加成
        }
    ]
}

const 鸢 = {
    "desc": Desc,
    "skill": Skill,
    "tea": Tea
}

export { 鸢 }