import { SkillColorEnum } from '../enum/skillSimpleEnum.ts';
import { ToastSkillEnum } from '../enum/toastSkillEnum.ts';
import { MXLaohenEnum } from '../enum/laohenNameEnum.ts';
import { speSkillCon } from '../consts/SkillCon.ts';

const Desc = {
    "job": "筑术师", "skill": [MXLaohenEnum.自动瞄准系统三角α型, MXLaohenEnum.炽锋叠势], "attr": "yan", "star": "6",
    "nameEn": "LONG HE", "tag": ["输出", "群攻", "元素区域"], "originWorld": "海错", "orginChar": "原创",
    "cv": "", "openDate": "2025年03月06日", "resourse": ["定向潜航·潮生流火"],
    "introText": "金鳞族，龙和。你就是监督？我妹妹龙晴承蒙你照拂了。有什么用得上我的地方，你只管说，我必全力相助。",
    "tacgie": {
        "name": "初始外装",
        "listNames": ["立绘", "S4立绘", "3D"],
        "imgs": [
            "5/52/nkrd5iepofe1qgu39t8fj5mmvx8syhg.png",
            "3/3f/kgualcx3jd6qbmtoqyc3bci0tee6u6b.png",
            "1/11/es1e4sh667fyvwegwwub7n38zvb02wv.png"
        ]
    }
}

const Skill = [
    {
        "name": "沸红",
        "aliasNum": "1",//技能简称，1技能
        "maxLevel": 15,//技能最大等级
        "detail": {
            "type": "主动技能",//技能类型，主动、被动、自定等
            "skillTab": [["指令冷却", "25秒"], ["次数", "3"]],//技能使用情况，如冷却，可使用次数
            "tab": ["炎区域", "伤害", "拦截", "对空", "穿透屏障"],//技能标签
            "content": [
                "对指定区域的敌人造成",
                speSkillCon("3360％最终攻击的炎元素伤害"),
                "，并拦截区域内的所有投射物，同时产生炎元素地形"
            ]//满级技能内容描述
        }
    },
    {
        "name": "燃犀",
        "aliasNum": "2",
        "maxLevel": 15,
        "detail": {
            "type": "自动技能",
            "skillTab": [["增益冷却", "15秒"], ["增益持续", "15秒"]],
            "tab": ["自身增益"],
            "content": [
                "回复1次【沸红】使用次数",
                "",
                "在增益持续期间，攻击速度提高",
                speSkillCon("60%"),
                speSkillCon("(属性乘区·攻击速度)", SkillColorEnum.injuries),
                "，且普通攻击变成具有穿透性的阙龙剑，对命中的单位造成",
                speSkillCon("896％最终攻击的炎元素伤害"),
                "，并使目标降低",
                speSkillCon("30%"),
                speSkillCon("(目标减益乘区·目标抗性降低)", SkillColorEnum.injuries, ToastSkillEnum.目标减益乘区目标抗性降低),
                "炎元素抗性，持续",
                speSkillCon("4"),
                "秒"
            ]
        }
    },
    {
        "name": "无忌",
        "aliasNum": "异核",
        "maxLevel": 6,
        "detail": {
            "type": "异核技能",
            "skillTab": [["充能时间", "80秒"]],
            "tab": ["伤害", "自身增益", "对空"],
            "content": [
                "在指定位置形成",
                speSkillCon("600"),
                "范围的龙纹区域，持续",
                speSkillCon("15"),
                "秒。龙纹区域存在时，每秒对区域内的敌人造成",
                speSkillCon("400％最终攻击的炎元素伤害"),
                "，当龙和对龙纹区域内的敌人造成暴击时，伤害提高",
                speSkillCon("30%"),
                speSkillCon("(增伤乘区·独立增伤)", SkillColorEnum.injuries),
                "。",
                "",
                "技能施放后，龙和进入「海祟」状态，持续",
                speSkillCon("30"),
                "秒。在此状态的增益持续时间内，龙和能够触发「燃犀」所有的持续增益效果，且暴击率提高",
                speSkillCon("50%"),
                "。龙和每",
                speSkillCon("2"),
                "次普通攻击，可以对命中的1个单位（优先选取精英及首领目标）造成",
                speSkillCon("300"),
                "范围内",
                speSkillCon("1250％最终攻击的炎元素伤害"),
                "且向两侧额外生成阙龙剑攻击敌人，该伤害视为普通攻击伤害。该效果触发时，普通攻击每额外命中一个单位可以扩大",
                speSkillCon("50"),
                "范围，最多可以扩大至",
                speSkillCon("500"),
                "范围。在增益持续时间内，最多可以触发",
                speSkillCon("10"),
                "次。"
            ]
        }
    },
    {
        "name": "特性：一笑作千温",
        "aliasNum": "特性",//特性技能需要特殊处理，在具体的地方需要用v-if判断
        "detail": {
            "type": "战斗特性",
            "tab": [["射程", "1200"], ["攻击速度", "0.40次每秒"]],
            "atType": ["单体", "对空"],
            "content": [
                "对目标投掷阙龙刃，造成",
                speSkillCon("250％最终攻击的炎元素伤害")
            ],//普通攻击
            "specialContent": [
                [
                    "在不同状态下，可以使用不同的形态的普通攻击",
                    "",
                    "龙和的普通攻击对炎元素地形上的敌人造成的伤害提高",
                    speSkillCon("20%"),
                    speSkillCon("(增伤乘区·独立增伤)", SkillColorEnum.injuries),
                    "，当场上只有一个敌人时，此效果提高至",
                    speSkillCon("30%"),
                    speSkillCon("(增伤乘区·独立增伤)", SkillColorEnum.injuries),
                ],//零花本体特性
                [
                    "登场时异核充能",
                    speSkillCon("60"),
                    "秒。「海祟」的触发伤害提高",
                    speSkillCon("40%"),
                    speSkillCon("(增伤乘区·独立增伤)", SkillColorEnum.injuries),
                    "。进入「燃犀」状态时，会对场上敌人单位触发",
                    speSkillCon("3"),
                    "次「海祟」的",
                    speSkillCon("300"),
                    "范围伤害效果（优先精英及首领目标）"
                ],//一花特性
                [
                    "普通攻击的伤害提高",
                    speSkillCon("30%"),
                    speSkillCon("(增伤乘区·独立增伤)", SkillColorEnum.injuries),
                    "，异核充能时间减少",
                    speSkillCon("20"),
                    "秒，且龙纹区域持续时间增加",
                    speSkillCon("15"),
                    "秒"
                ]//三花特性
            ]
        }
    }
]

const Tea = {
    "achievement": [
        {
            "name": "不吃苦中苦",
            "limit": "【默契值4级】",
            "tips": [
                "龙和端详着手中名为咖啡的饮品：“森罗人实在奇怪，费尽周章竟是为了‘吃点苦头’。就是当年修习术法之时，我也不曾这么为难过我自己。”",
                "“这不是为了工作吗……我帮你把这杯加了双倍浓缩的咖啡端下去吧。”",
                "“多谢。”"
            ],
            "recipe": [
                "熊熊杯",
                "经典特浓咖啡",
                "椰浆",
                "加双份",
                "原味雪顶",
                "蝴蝶结"
            ]
        },
        {
            "name": "突生变故",
            "limit": "【默契值10级】",
            "tips": [
                "“监督，此物凶险异常，光是饮下，便觉得喉头隐隐作痛，恐怕是被人下了咒！看我————”",
                "“啊啊啊啊！苏打水我已经撤了！！你不要火烧吧台啊啊！！”"
            ],
            "recipe": [
                "简约至上",
                "冰镇苏打水",
                "多冰",
                "咸梅干",
                "精致纸伞"
            ]
        },
        {
            "name": "？？？？？",
            "limit": "【默契值8级】",
            "tips": [
                "“………………”龙和浅抿了一口竹节茶杯中的白水，双眉紧蹙，默然不语。",
                "“怎么不说话？在陆地上喝水的感觉怎么样？”",
                "有种……一边呼吸一边……‘呼吸’的感觉……好生奇怪……监督，你能懂吗？"
            ],
            "recipe": [
                "竹节茶杯",
                "白开水",
                "常温",
                "盐",
                "空心圆匙"
            ]
        },
        {
            "name": "本性难改",
            "limit": "【默契值6级】",
            "tips": [
                "“你虽然不喜爱森罗那些工序过多、精于制作的饮品，但是对各色酒水倒是来者不拒。”",
                "“于我而言，酒只分烈度。不管加什么都难改其本，无甚要紧。”",
                "“那你手里那杯夜色危情对你来说怎么样？要不要再烈一些？”",
                "“不必了。已然足矣。”"
            ],
            "recipe": [
                "简约至上",
                "夜色危情",
                "少冰",
                "偏淡",
                "水果签"
            ]
        },
        {
            "name": "终知晓",
            "limit": "【默契值13级】",
            "tips": [
                "“噗嗤……”",
                "“监督笑什么？”",
                "“你啊，不仅和龙晴点的一模一样，就连喝下时的表情都一样。”",
                "“可我妹妹并不喜欢枸杞菊花茶啊，她为什么要点？”",
                "“………………………………啊。”",
                "也许是因为她想你了吧。",
                "监督没有将话挑明，只是等龙和自己想明白。"
            ],
            "recipe": [
                "自证方圆",
                "枸杞菊花茶",
                "杨桃",
                "叶子冻",
                "空心圆匙"
            ]
        },
        {
            "name": "顿悟",
            "limit": "【默契值16级】",
            "tips": [
                "“怎么会有人不喜欢汪汪饼干！”",
                "“太甜。”",
                "“………………可是它造型可爱啊！！”",
                "龙和歪了歪头，用银杏叶将杯中的饼干捞了上来，细细端详了一番。",
                "“可爱之事暂且不谈，监督，你觉不觉得它有些像……温留前辈？”"
            ],
            "recipe": [
                "竹节茶杯",
                "冰镇酸梅汤",
                "五分糖",
                "汪汪饼干",
                "银杏叶"
            ]
        },
        {
            "name": "主观能动性",
            "limit": "【默契值18级】",
            "tips": [
                "“咦？你不是不爱喝过甜和过度制作的饮品吗？怎么端着杯杨枝甘露。”",
                "“我原是不喜，可元桃桃带我去店里见了一回。我才知道，一杯杨枝甘露竞需要费那么多功夫————我决定从此喜欢它了。”",
                "“口味这种事，是能靠你自己主观上决定的吗？”",
                "“自然！”",
                "只见龙和深吸一口气，居然将整杯一饮而尽！",
                "“要不还是算了吧……”"
            ],
            "recipe": [
                "熊熊杯",
                "杨枝甘露",
                "樱桃",
                "椰果",
                "柠檬片"
            ]
        }
    ],
    "hignRapport": [
        {
            "needLevel": 1,
            "recipe": [
                "柚柚切颗NOW",
                "五分糖",
                "杨桃"
            ],
            "ex": [544, 609, 664],//参考默契值，无加，满家具，满加成
        },
        {
            "needLevel": 5,
            "recipe": [
                "枸杞菊花茶",
                "枸杞",
                "咸梅干"
            ],
            "ex": [620, 695, 758],//参考默契值，无加，满家具，满加成
        }
    ]
}

const 龙和 = {
    "desc": Desc,
    "skill": Skill,
    "tea": Tea
}

export { 龙和 }